/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe, sublib } from './index';
import * as StrUtil from 'str-util';

/**
 * 改成小說名字
 */
export const lang = 'NO FATIGUE 24時間戦える男の転生譚';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = sublib._word_zh_all([

	/**
	 * 埃德加・彻貝尔
	 */
	['加木智紀|加树智纪|嘉義智紀', '加木智紀'],
	['艾德加|埃德加', '艾德加'],
	['艾德|埃德', '艾德'],


	/**
	 *
	 */
	['杵崎亨|杵岬亨', '杵崎亨'],

	/**
	 * 阿尔弗雷德・彻貝尔
	 * 母亲：茱莉娅
	 * 貝勒哈特
	 * 彻斯特
	 * 大卫
	 *
	 * 斯蒂法涅・斯戴夫
	 */
	['朱麗葉|茱莉娅|朱莉娅', '茱莉婭'],
	['徹贝尔|彻貝尔', '彻貝尔'],

	['斯蒂法涅尼?|Stephanie|斯蒂芬涅?尼?', '斯蒂法涅'],

	/**
	 * 女神阿斯特拉
	 * 战神玛魯萨魯多
	 */

	/**
	 * 魔神摩卢恩韦苏
	 * 惡神摩卢恩韦苏
	 */

	/**
	 * 圣塔玛那王国
	 * 泽瑞克堡垒
	 * 格魯沙（グルシャー，CountGrusha）
	 * 扎克侯特茲（ザックホルツ，Zakholtz）堡垒
	 *
	 * 奈比奧洛斯 ネビュロス
	 *
	 * 柯貝特村，瑞貝瑞特村，特瑞那多特村，庫雷特村，霍諾市（回忆之声市）
	 *
	 */
	['扎克侯特茲|ザックホルツ|Zakholtz', '扎克侯特茲'],
	['然?泽瑞克', '泽瑞克'],
	['泽瑞克城寨|泽瑞克堡垒', '泽瑞克堡垒'],

	/**
	 * 森諾拉多（ソノラート）
	 */
	['玛瑞克多|瑪爾克多?', '玛瑞克多'],
	['森諾拉多|ソノラート', '森諾拉多'],

	/**
	 *
	 */
	['黒狼の?牙|黑狼的獠牙', '黒狼の牙'],
	['格雷萨|ゴレス', '格雷萨'],

	/**
	 * 阿巴頓魔法全書
	 * 西裡爾字母
	 */
	['不易不労|不易不劳', '不易不労'],
	['インスタント通訳|即时解读|即时翻译', '即时解读'],
	['善神の加護|善神的祝福', '善神の加護'],
	['炎獄の魔女|炎獄的魔女|炎狱之巫女|焰狱的魔女', '炎獄的魔女'],
	['阿巴頓魔法全書|阿巴顿魔術全书', '阿巴頓魔法全書'],
	['無文字発動|无咏唱启动', '無文字発動'],
	['念動力?魔法|念动魔发', '念動魔法'],
	['多重启动|多重発動|同時発動', '同時発動'],
	['魔法文字|魔力文字|魔術文字|魔发文字', '魔法文字'],
	['火精魔法|火精魔術', '火精魔法'],
	['数据庫|データベース', '数据庫'],
	['火焰风暴|火炎嵐', '火炎嵐'],
	['付加魔法|附加魔法', '附加魔法'],
	['掠夺旅団|略奪旅団', '略奪旅団'],
	['悪神の呪禍|惡神的咒祸', '惡神の呪禍'],
	['绯红之子 绯红之子|绯红之子|孩子・绯红|赫ん坊', '绯红之子'],
	['魔力感知|魔力察觉', '魔力感知'],
	['魔力制御', '魔力制御'],
	['火精の加護|火精的保佑', '火精の加護'],
	['軍神の注目|战神的注视', '軍神の注目'],
	['物理魔发|物理魔法', '物理魔法'],
	['火焰比特|フレイムビット', '火焰比特'],
	['魔发|魔法', '魔法'],


	/**
	 *
	 */
	['皇家的?图书馆|王立图书馆|王立図書館', '王立圖書館'],
	['図書館', '圖書館'],


	/**
	 *
	 */
	['童真的面容', '童顏'],
	['レベル|等級', '等級'],
	['スキル|技能|技艺', '技能'],

	/**
	 *
	 */

	[/^(?: |(　) )/gm, '$1'],
	[/^　+(?!　)/gm, ''],
	[/(】)\-$/gm, '$1－'],

	[/(\d+)/g, function (...m)
	{
		return StrUtil.toFullNumber(m[1]);
	}],

	[/([^\w\u00C0-\u017F\.μ・·?‧•―-])([a-z])(?![\w\u00C0-\u017F\.μ・·?‧•―-])/ig, function (...m)
	{
		return m[1] + StrUtil.toFullWidth(m[2]);
	}],

	[/LV|HP|MP|EXP/ig, function (s)
	{
		return StrUtil.toFullEnglish(s.toUpperCase());
	}],

	//[/【/g, '「'],
	//[/】/g, '」'],

	...sublib.lazymarks['class'],

	...sublib.lazymarks[4],
	...sublib.lazymarks[0],
	...sublib.lazymarks[1],
	...sublib.lazymarks[2],
	...sublib.lazymarks[3],
	...sublib.lazymarks[5],

	[/(\S\n)(?=─)/gm, '$1\n'],
	[/^(─[^\n]+\n)(?=\S)/gm, '$1\n'],

	[/^(　*【[^\n]+)\n{2}(　*【)/gm, '$1\n$2'],
	[/^[\.>]/gm, '・'],

]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
