/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe, sublib } from './index';
import * as StrUtil from 'str-util';

/**
 * 改成小說名字
 */
export const lang = 'NO FATIGUE 24時間戦える男の転生譚';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = sublib._word_zh_all([

	/**
	 * 埃德加・彻貝尔
	 */
	['加木智紀|加树智纪|嘉義智紀', '加木智紀'],
	['艾德加|埃德加', '艾德加'],
	['艾德|埃德', '艾德'],

	/**
	 * 阿尔弗雷德・彻貝尔
	 * 母亲：茱莉娅
	 * 貝勒哈特
	 * 彻斯特
	 * 大卫
	 *
	 * 斯蒂法涅・斯戴夫
	 */
	['朱麗葉|茱莉娅|朱莉娅|茱莉亞', '茱莉婭'],
	['徹贝尔|彻貝尔', '彻貝尔'],
	['切斯特|彻斯特', '彻斯特'],
	['貝尔哈特|貝勒哈特', '貝勒哈特'],


	['斯蒂法涅尼?|Stephanie|斯蒂芬涅?尼?', '斯蒂法涅'],
	['斯蒂夫|斯戴夫', '斯蒂夫'],

	['直屬家臣|直臣', '直屬家臣'],

	/**
	 * 女神阿斯特拉
	 * 战神玛魯萨魯多
	 */

	/**
	 * 魔神摩卢恩韦苏
	 * 惡神摩卢恩韦苏
	 */
	['杵崎亨|杵岬亨|木崎徹', '杵崎亨'],
	['杵崎|杵岬|木崎', '杵崎'],

	/**
	 * 圣塔玛那王国
	 * 泽瑞克堡垒
	 * 格魯沙（グルシャー，CountGrusha）
	 * 扎克侯特茲（ザックホルツ，Zakholtz）堡垒
	 *
	 * 奈比奧洛斯 ネビュロス
	 *
	 * 柯貝特村，瑞貝瑞特村，特瑞那多特村，庫雷特村，霍諾市（回忆之声市）
	 *
	 * 王都，莫诺科查努斯（Monocchanus）
	 *
	 * 国王，威斯高德一世
	 *
	 */
	['圣玛纳|圣塔玛那', '圣塔玛那'],

	['扎克侯特茲|ザックホルツ|Zakholtz', '扎克侯特茲'],
	['然?泽瑞克', '泽瑞克'],
	['泽瑞克城寨|泽瑞克堡垒', '泽瑞克堡垒'],
	['特瑞那多特?|特瑞纳多|Trenadette', '特瑞那多特'],

	/**
	 * 霍諾市
	 * 莫里亞・米特魯铎・泽庫魯納修
	 *
	 * 梭洛＝阿德拉・阿巴顿
	 *
	 * 麦露薇的主人──艾魯菲西亞
	 */
	['索罗|梭洛', '梭洛'],
	['莫里亞|莫利亚', '莫里亞'],
	['霍夫曼|哈夫曼', '哈夫曼'],

	[`泽克納什|泽庫魯納修|泽庫魯納修`, '泽庫魯納修'],

	[`Moria Mittelt Zkornash|莫里亞・米特魯铎・泽庫魯納修`, '莫里亞・米特魯铎・泽庫魯納修'],

	[`莫里亞${sp}(?:梅特尔特|米特魯铎)${sp}(?:泽克納什|泽庫魯納修)`, '莫里亞・米特魯铎・泽庫魯納修'],

	['哈克皮埃|哈比', '哈比'],
	['米兰达|Miranda', '米兰达'],

	/**
	 * 塞西莉和赛西莉娅
	 * 塞塞露和賽賽菈
	 */
	[`图莎${sp}阿瓦蒂`, '图莎・阿瓦蒂'],

	['賽西莉婭|賽賽菈', '賽賽菈'],
	['塞西莉(?!婭)|塞塞露', '塞塞露'],

	['麦露薇|Melby', '麦露薇'],

	['图希拉瓦提|Tushaaravati', '图莎・阿瓦蒂'],
	[`图莎${sp}阿瓦蒂`, '图莎・阿瓦蒂'],

	/**
	 * 森諾拉多（ソノラート）
	 * 聖諾瓦格（Sonoraat）
	 */
	['玛瑞克多|瑪爾克多?', '玛瑞克多'],
	['森諾拉多|ソノラート|聖諾瓦格|Sonoraat', '森諾拉多'],

	/**
	 * 【八咫鸟】教主格魯特梅茲
	 * 【八咫烏】首領赞恩・闵采尔
	 *
	 * 《貝克：【八咫烏】第１班所属。年龄：８岁。等級１５。》
	 《米格尔：【八咫烏】第１班所属。年龄：９岁。等級１９。》
	 《愛蕾米娅：【八咫烏】特别任务班所属。年龄：７岁。等級２１。》
	 《多娜：< 	八咫烏 >第１班所属。年龄：１１岁。等級１８。》

	 * 愛蕾米娅・罗德魯特（【八咫烏】特别任务班所属・《黄昏森林的巫女》）
	 * 米格尔・米特魯铎（【八咫烏】第１班所属・《麒麟儿》）
	 *
	 * 多娜・哈沙 獸人（月狗族）
	 * 格納修・亞舒巴魯（《药師》・《药聖》・《宿老》
	 *
	 * 貝克・翁（【八咫烏】第１班所属・《小金刚》）
	 *
	 * 艾古尼亞・艾格伦海姆（《灼熱竜》・「劍岳的」《东之峰的主人》
	 *
	 * Herumuto・Haidorihi
	 * Sharuha・Vokusu，是在遺跡内的Herumuto・Haidorihi
	 *
	 * 盖兹欧・奧特罗
	 */
	['黒狼の?牙|黑狼的獠牙|黑狼の獠牙', '黒狼の牙'],
	['格雷萨|ゴレス|Goresu|Goleth', '格雷萨'],
	['八咫烏|八咫鸟|八咫鸦', '八咫烏'],

	['Beck|貝克', '貝克'],
	['莫娜|多娜|Donna', '多娜'],
	['米切尔|米格尔|Miguel', '米格尔'],

	['纳贝尔|内维尔|Nebil', '内维尔'],

	['爱莉米娅|愛蕾米娅', '愛蕾米婭'],

	['Guni|艾古尼亞|阿格尼婭|Agnia', '艾古尼亞'],

	['海德瑞斯|Heydrich|Haidorihi', '海德瑞斯'],

	['Gazein|赞恩', '赞恩'],

	['盖兹欧|Gazlow|gazuro', '盖兹欧'],

	['魔神|悪神', '惡神'],
	['信使|御使', '御使'],
	['莱提西亞|Letticia', '莱提西亞'],


	/**
	 * 阿巴頓魔法全書
	 * 西裡爾字母
	 */
	['不易不労|不易不劳', '不易不労'],
	['疲労転移|疲劳转移', '疲劳转移'],

	['インスタント通訳|即时解读|即时翻译', '即时解读'],
	['善神の加護|善神的祝福', '善神の加護'],
	['炎獄の?魔女|炎獄的?魔女|炎狱之?巫女|焰狱的?魔女', '炎獄的魔女'],
	['阿巴頓魔法全書|阿巴顿魔術全书', '阿巴頓魔法全書'],
	['無文字発動|无咏唱启动|无咏唱发动', '無文字発動'],
	['念動力?魔法|念动魔发', '念動魔法'],
	['多重启动|多重発動|同時発動', '同時発動'],
	['魔法文字|魔力文字|魔術文字|魔发文字|魔法符号', '魔法文字'],

	['数据庫|データベース', '数据庫'],
	['火焰风暴|火炎嵐', '火炎嵐'],
	['付加魔法|附加魔法', '附加魔法'],
	['掠夺旅団|略奪旅団', '略奪旅団'],
	['悪神の呪禍|惡神的咒祸', '惡神の呪禍'],
	['绯红之子 绯红之子|绯红之子|孩子・绯红|赫ん坊', '绯红之子'],
	['魔力感知|魔力察觉', '魔力感知'],
	['魔力制御', '魔力制御'],
	['火精の加護|火精的保佑', '火精の加護'],

	['軍神の注目|战神的注视|战神的守望', '軍神の注目'],
	['軍神|战神', '軍神'],

	['物理魔发|物理魔法', '物理魔法'],
	['火焰比特|フレイムビット', '火焰比特'],
	['雷电魔法|雷魔法', '雷魔法'],
	['魔发|魔法', '魔法'],

	['昏き森の巫女|黄昏森林的巫女', '黄昏森林的巫女'],
	['昏き森の祝福|黄昏森林的祝福|黑暗森林的祝福', '黄昏森林的祝福'],

	['炎霊の鎧甲?|炎灵的鎧甲', '炎靈的鎧甲'],
	['炎霊鋼製', '炎靈鋼製'],
	['炎霊', '炎靈'],

	['精霊', '精靈'],
	['輪廻', '輪廻'],

	['始祖(精靈|妖精)|始源精靈', '始祖精靈'],
	['輪廻神的关注|輪廻神の注目', '輪廻神の注目'],
	['輪廻神への誓約|輪廻神的誓约', '輪廻神の誓約'],

	['(精靈|妖精)の歌', '妖精の歌'],

	['魔法戦士|魔術战士', '魔法戦士'],
	['夜视|夜目', '夜視'],
	['黑暗视觉|暗視', '暗視'],

	['地（土）属性魔法|地精魔法|地属性魔法', '地精魔法'],
	['(火|地|光|風)(?:精靈?|元素|属性)(?:魔法|魔術)', '$1精魔法'],
	['黑暗魔法|闇魔法', '闇魔法'],

	['魔力検知|魔力探查', '魔力探查'],
	['魔法语言|魔法言語', '魔法语言'],

	['危险感知|危険察知', '危险感知'],

	['気配察知|气息察觉|感知存在|气息查知', '气息察觉'],
	['サイコキネシス|意念力', '意念力'],
	['心念交流|念話|念話', '念話'],
	['手里剑技|手裏剣術', '手裏剣術'],

	['传奇级|伝説級|传说級', '传说級'],
	['大师级|达人級', '達人級'],

	['烹饪|料理', '料理'],
	['启示录|黙示録', '黙示録'],

	['薬神の注目|药神的关注', '薬神の注目'],

	['第二名', '別名'],

	['忍び?足|蹑足|隐秘步伐', '忍足'],

	['无底的大蛇|底無しのオロチ|无限の?大蛇', '无底的大蛇'],

	['精灵之里|妖精郷', '妖精郷'],
	['精靈之友', '妖精之友'],
	['大師', '導師'],
	['奴役项圈|隷属の首輪|奴隷项圈', '奴隷项圈'],

	['红文字|緋文字', '緋文字'],

	/**
	 *
	 */
	['皇家的?图书馆|王立图书馆|王立図書館', '王立圖書館'],
	['図書', '圖書'],


	/**
	 *
	 */
	['絶息|气絶', '气絶'],
	['遺跡|遗迹', '遺跡'],
	['童真的面容', '童顏'],
	['レベル|等級', '等級'],
	['スキル|技能|技艺', '技能'],
	['(?:公|工|行)会', '公会'],
	['=', '＝'],
	['銃', '銃'],
	['戦', '战'],
	['霊', '靈'],

	['火辰|火竜', '火竜'],

	//['竜|龍', '竜'],

	/**
	 *
	 */

	[/^(?: |(　) )/gm, '$1'],
	[/^　+(?!　)/gm, ''],
	[/(】)\-$/gm, '$1－'],

	[/(\d+)/g, function (...m)
	{
		return StrUtil.toFullNumber(m[1]);
	}],

	[/([^\w\u00C0-\u017F\.μ・·?‧•―-])([a-z])(?![\w\u00C0-\u017F\.μ・·?‧•―-])/ig, function (...m)
	{
		return m[1] + StrUtil.toFullWidth(m[2]);
	}],

	[/LV|HP|MP|EXP/ig, function (s)
	{
		return StrUtil.toFullEnglish(s.toUpperCase());
	}],

	//[/【/g, '「'],
	//[/】/g, '」'],

	...lazymarks['class'],

	...lazymarks[4],
	...lazymarks[0],
	...lazymarks[1],
	...lazymarks[2],
	...lazymarks[3],
	...lazymarks[5],

	[/(\S\n)(?=─)/gm, '$1\n'],
	[/^(─[^\n]+\n)(?=\S)/gm, '$1\n'],

	[/^(　*【[^\n]+)\n{2}(　*【)/gm, '$1\n$2'],
	[/^[\.>]/gm, '・'],

]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
