/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe } from '.';
import * as StrUtil from 'str-util';

/**
 * 改成小說名字
 */
export const lang = 'ウォルテニア戦記';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = [

	//['要取代的字', '取代後的字'],

	//['— —', '——'],

	[/被?(?:异世界召唤|召唤到异世界|召唤到异世界|召喚到異世界)後?[的]?[第]?(\d+)[日天]目?/gm, '异世界召唤第$1日'],

	[/(异世界召唤第?\d+[日天]目?|第\d+[日天])([^\n]*)[\[「\{（]([^\]\n]+)[\]」\}）]/gm, '$1$2【$3】'],

	[/(异世界召唤第\d+日[^\n]*)[ ]+(【)/gm, '$1$2'],

	[/(异世界召唤第\d+日[^\n]*)(\:)?\n+/g, function (...m)
	{
		if (m[2])
		{
			m[2] = StrUtil.toFullWidth(m[2]);
		}
		else if (typeof m[2] == 'undefined')
		{
			m[2] = '';
		}

		return `${m[1]}${m[2]}\n\n`;
	}],

	['奥尔特梅亚|奧德梅亞|奥特梅亚|奥路托米亚|奥德梅亚|奥德梅亚', '奥德梅亚'],

	['盖耶斯|盖亚西|该耶斯', '盖耶斯'],
	['夏蒂娜|夏鲁缇娜|夏迪娜', '夏蒂娜'],

	['玛飞锡特|瑪飛錫特|玛非菲锡|玛非锡特|马尔菲斯特|梅尔菲斯|馬爾菲斯特|瑪爾菲斯特', '瑪非錫特'],
	['萨拉|莎拉', '莎拉'],
	['萝拉', '萝拉'],

	/**
	 * @todo 第二章
	 */
	// #25 #26
	['纱雅|咲耶|咲夜|佐久夜', '咲夜'],
	['纳尔蒂娜|梅爾緹娜|纳尔迪娜', '梅爾緹娜'],
	['貝爾格斯通|伯格顿|贝尔古斯通|貝爾古斯通', '貝爾古斯通'],
	['格哈德|格哈特|格魯哈魯特|格哈魯|盖尔哈特', '格哈特'],
	['平民公主|庶民公主', '庶民公主'],
	['露碧丝|露比丝|露碧絲', '露碧絲'],
	['霍城|霍德拉姆|霍洛兰|鼓城|忽多蘭|忽德兰', '霍德拉姆'],
	['大厅鼓?将军', '霍德拉姆将军'],
	['羅赛里亚王国|李尔王国', '羅赛里亚王国'],
	['羅赛里亚|罗泽利亚|羅賽里亞|罗赛里雅', '羅赛里亚'],
	['米海爾|米歇尔|米海尔', '米海爾'],
	['艾蕾娜|埃琳娜|艾莲娜', '艾蕾娜'],

	['比雷埃夫斯|匹雷乌斯', '比雷埃夫斯'],

	// @todo 紅獅子
	['莉欧奈|黎歐內|麗歐奈|丽欧奈|丽奥奈', '莉欧奈'],
	['波尔茨|波爾斯|波爾次|伯罗斯|波爾茲|波爾茨', '波尔茨'],

	['严翁|嚴翁', '嚴翁'],

	//['沃特尼亚'],

	/**
	 * @todo 第三章
	 */
	['尤利亚|尤莉娅', '尤莉娅'],
	['扎尔茨贝格|扎尔茨堡|扎茨尔伯格', '扎尔茨堡'],
	['希莫奴|希莫里', '希莫奴'],

	['暗[道巷]理', '暗巷裡'],
	['暗道', '暗巷'],
	['米耶尔斯|密斯托尔', '密斯托尔'],
	['伊庇鲁斯|伊匹洛斯|伊畢洛斯', '伊匹洛斯'],
	['克裡斯托夫|克里斯托夫', '克里斯托夫'],

	['梅丽萨|梅丽莎|梅利薩', '梅丽莎'],

	[/([斯娅奴])\?(扎爾茨堡|克里斯托夫)/g, '$1・$2'],

	['约书亚|喬書亞', '约书亚'],
	['佩爾哈雷斯|贝哈雷斯|配爾哈雷', '佩爾哈雷斯'],

	/**
	 * @todo 第四章
	 */
	['西蒙尼|西蒙娜', '西蒙娜'],

	['赤果+', function ($0)
	{
		return $0.replace(/果/g, '裸');
	}],

	['加增', '增加'],
	['選擇肢裡', '選擇裡'],
	['關西(?!方|邊)', '關係'],

	['的媽？', '的吗？'],

	['想到的注意', '想到的主意'],
	['尽然回事', '竟然會是'],
	['尽然', '竟然'],
	['、廉贞', '、亮真'],
	['能上站成', '能上战场'],
	['撤退站', '撤退战'],

	['只道先带', '只到先代'],
	['少侠|少主', '少主'],

	[/強\(女女女\)/g, '強姦'],

	[/\*{2,3}ノ本/, '日ノ本'],

	[/\[/g, '「'],
	[/\]/g, '」'],

	[/^([^\n"“”「」]*)["“]([^\n"“”「」]*)["”]/gm, '$1「$2」'],
	[/\{([^\n\{}【】「」]*)\}/gm, '【$1】'],
	[/^([^\n"“”『』]*)["“]([^\n"“”『』]*)["”]/gm, '$1『$2』'],

	[',', '、'],

	[/[\!\(\):]|\d+[：:]/g, function (...m)
	{
		return StrUtil.toFullWidth(m[0], {
			skip: {
				space: true,
			},
		});
	}],

	[/([\u4E00-\u9FFF])\.(?!\.)/g, '$1。'],

	[/\n([ ]*[^：\n]+)\n+[ ]*([^：\n]+：[^\n]*)/ug, '\n$1\n\n$2'],
	[/\n[ ]*([^：\n]+：[^\n]*)\n+([ ]*[^：\n]+\n)/ug, '\n$1\n\n$2'],

	[/\n+\-+\n+/gm, '\n\n\n'],

	[/(\n)[　\u3000　　]{2,}/g, '$1　'],

] as IWords[];

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
