/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe, sublib } from './index';
import * as StrUtil from 'str-util';
import { _word_en, lazymarks, _word_jp1 } from './lib/index';

/**
 * 改成小說名字 (可留白 則自動設定為檔案名稱)
 */
export const lang = '';

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words_source: IWords[] = [

	_word_jp1('茜兒|ジル', '茜兒'),
	['茜提安娜|シルティアーナ', '茜提安娜'],

	/**
	 * 闇之森
	 */
	['蕾吉娜|レジーナ|雷吉娜', '蕾吉娜'],

	['瑪雅|マーヤ', '瑪雅'],
	['黑暴貓', '黑暴貓'],

	['菲婭|フィーア', '菲婭'],

	[`克里斯蒂亞娜|クリスティアーネ`, '克里斯蒂亞娜'],
	[`克里斯蒂|クリスティ`, '克里斯蒂'],
	_word_jp1(`リタ|麗塔`, '麗塔'),
	[`ブラントミュラー|勃蘭特穆勒`, '勃蘭特穆勒'],

	[`克里斯蒂亞娜・麗塔・勃蘭特穆勒`, '克里斯蒂亞娜・麗塔・勃蘭特穆勒'],

	['巴爾托洛梅|バルトロメイ', '巴爾托洛梅', 'ig'],

	/**
	 * 開拓村
	 */
	['朵彌茨阿諾|ドミツィアーノ', '朵彌茨阿諾'],
	['舊朵彌茨阿諾|旧ドミツィアーノ', '舊朵彌茨阿諾'],

	['安迪|アンディ', '安迪'],
	['查德|札德|チャド', '查德'],

	['艾蓮|エレン', '艾蓮'],
	['亞羅德|亞羅路德|アロルド', '亞羅路德'],
	['巴雷吉|バレージ', '巴雷吉'],
	['卡麗娜', '卡麗娜'],

	['洛克', '洛克'],

	['布魯諾|ブルーノ', '布魯諾'],

	['艾米麗', '艾米麗'],
	['伊莎貝拉', '伊莎貝拉'],

	// 珍妮特阿姨是牧場主丹先生的夫人
	['珍妮特', '珍妮特'],
	['丹', '丹'],

	/**
	 * 奧蘭修
	 */
	[`利貝提姆|リビティウム`, '利貝提姆'],


	[`格魯拉德|コルラード`, '格魯拉德'],
	[`西蒙|シモン`, '西蒙'],
	[`オーランシュ|奧蘭修`, '奧蘭修'],

	[`格魯拉德・西蒙・奧蘭修`, '格魯拉德・西蒙・奧蘭修'],

	[`西蒙內塔|シモネッタ`, '西蒙內塔'],

	[`クララ|克拉拉`, '克拉拉'],


	/**
	 * 克爾圖拉
	 */
	[`克爾圖拉|克魯圖拉|クルトゥーラ`, '克爾圖拉'],

	[`阿克蒙德|エグモント`, '阿克蒙德'],
	[`拜夜|バイアー`, '拜夜'],
	[`阿克蒙德・拜(?:夜|也)`, '阿克蒙德・拜夜'],

	/**
	 * 疾風之刃
	 */
	[`疾風之刃`, '疾風之刃'],

	/**
	 * 萊卡 女戰士
	 *
	 */
	[`萊卡|ライカ`, '萊卡'],

	[`ジェシー|傑西`, '傑西'],
	[`傑西・亞蘭德`, '傑西・亞蘭德'],
	[`艾雷諾|艾蕾諾|エレノア`, '艾蕾諾'],

	/**
	 *
	 */
	_word_jp1('斯諾|スノウ', '斯諾', 'ig'),

	/**
	 *
	 */
	['修瓦塔', '修瓦塔', 'ig'],
	['薔薇姬', '薔薇姬', 'ig'],

	/**
	 *
	 */
	['馬里亞', '馬里亞', 'ig'],
	['里爾克', '里爾克', 'ig'],

	['菲尼斯・吉哈德', '菲尼斯・吉哈德', 'ig'],

	['喬伊・(?:亞蘭多|亞蘭德)', '喬伊・亞蘭德', 'ig'],

	/**
	 * 格拉畢歐魯帝國
	 */
	['格拉畢歐魯|グラウィオール', '格拉畢歐魯', 'ig'],

	_word_jp1('盧卡斯|ルーカス', '盧卡斯', 'ig'),
	_word_jp1('盧卡|ルーク', '盧卡', 'ig'),

	['雷恩巴魯特|レオンハルト', '雷恩巴魯特', 'ig'],

	['傑恩盧卡', '傑恩盧卡', 'ig'],

	['傑恩', '傑恩'],
	['瑪貝魯', '瑪貝魯'],

	['艾魯瑪|エイルマー', '艾魯瑪'],

	/**
	 * 帝都空瓦魯莉斯卡拉
	 */
	['黑暗森林|闇之森闇之森|黑暗之森林?|(黑|昏)?闇の森林?|テネブラエ？ネムス|Tenebrae ?Nemus|テネブラエ・ネムス', '闇之森', 'ig'],

	['シレント', 'シレント', 'ig'],

	[`クネパス${sp}ウルプス`, 'クネパス・ウルプス'],

	['空瓦魯莉斯(卡拉|艾)?|コンワルリス', '空瓦魯莉斯', 'ig'],

	/**
	 *
	 */
	['天狼星?|Sirius', '天狼', 'ig'],
	['小鬼（哥布林）', '哥布林', 'ig'],

	/**
	 *
	 */
	['マンドラドラ|曼陀羅陀羅', '曼陀羅陀羅', 'ig'],
	['靈藥|Amrita', '靈藥'],
	['赤の花冠|Rubel Flowes|赤色花冠|ルーベルフロース', '赤の花冠', 'ig'],

	/**
	 *
	 */
	['豚草|豬草|豕草', '豚草', 'ig'],
	['豚草公主|豚草姬|豕草公主|ブタクサ姬', '豚草姬', 'ig'],
	['魔女の女王|魔女之王', '魔女の女王', 'ig'],

	['八界仙|はっかせん', '八界仙', 'ig'],

	['公會|工會|ギルド', '公會', 'ig'],

	['黒い虐殺者|黑色虐殺者|ブラックデストロイヤー', '黑色虐殺者', 'ig'],

	['鐵匠之月|鍛冶の月', '鍛冶之月', 'ig'],

	['神の寵児|上帝的寵兒', '神的寵兒', 'ig'],

];

/**
 * 實際使用的取代樣式
 */
export const words: IWords[] = sublib._word_zh_all([

	...words_source,

	...sublib.lazymarks['class'],

	['國', '國'],
	['姫|姬', '姬'],
	['壞', '壞'],
	['學', '學'],
	['險', '險'],
	//['證', '證'],
	['剎', '剎'],
	['絕', '絕'],
	['殼', '殼'],
	['歲', '歲'],
	['隸', '隸'],
	['靈', '靈'],
	['[歴]', '歷'],
	['屬', '屬'],

	[/^[　 ]+/gm, ''],

	...sublib.lazymarks[4],

	...sublib.lazymarks['full_width_001'],
	...sublib.lazymarks['full_width_002'],

	...sublib.lazymarks[0],
	...sublib.lazymarks[1],
	...sublib.lazymarks[2],
	...sublib.lazymarks[3],
	...sublib.lazymarks[5],

] as IWords[]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

/**
 * 其他用途
 *
 * @deprecated
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

export default exports;
