/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe, sublib } from './index';
import * as StrUtil from 'str-util';
import { _word_en } from './lib/index';

/**
 * 改成小說名字
 */
export const lang = '俺の異世界姉妹が自重しない！';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = sublib._word_zh_all([

	['雨宮紗弥', '雨宮紗弥'],
	['紗弥', '紗弥'],
	['裕弥', '裕弥'],
	['雨宮', '雨宮'],

	/**
	 * 父亲—罗伯特
	 *
	 * 利昂
	 * 利約
	 *
	 * 克莱尔薇蒂娜
	 *
	 * 卡罗琳
	 *
	 * 新女仆玛丽
	 *
	 * 布雷庫
	 *
	 * 愛丽絲
	 * 艾莉絲提婭
	 *
	 */
	['愛丽絲|艾莉絲|艾莉斯|艾丽絲|愛丽斯', '艾莉絲'],
	['艾莉絲(提|緹)(婭|亞)|艾丽絲緹婭|艾莉絲提亞', '艾莉絲緹婭'],

	['里昂|利昂', '利昂'],
	['里约|利約', '利約'],

	['布雷庫|布莱克|克雷庫', '布莱克'],

	['米丽|米莉', '米莉'],
	['米歇尔|米楔尔|米谢尔|米榭尔', '米歇尔'],

	['卡萝莱茵|卡罗琳|卡洛琳', '卡洛琳'],
	['罗伯特|罗伯塔|卡莱茵', '罗伯特'],

	['克(蕾|莱)(雅|尔|娅)|克蕾儿', '克蕾雅'],
	['克蕾雅薇蒂娜|克莱尔薇蒂娜|克蕾娅莉蒂尔|克蕾雅莉蒂尔', '克蕾雅薇蒂娜'],

	['古兰歇斯|格魯西斯|格兰谢斯|古兰谢絲|古兰普希斯', '格魯西斯'],

	[`利昴？格魯西斯`, '利昴・格魯西斯'],
	[`(?:利昂|索菲亞)${sp}格魯西斯`, '$1・格魯西斯'],

	['(卡罗琳)先生', '$1桑'],
	['玛莉|玛丽', '玛莉'],

	/**
	 * 苏飞魯家的索菲亞
	 * 撒夫乌
	 *
	 * 卡洛斯（カルロス）
	 * 愛莉婕（エリーゼ）
	 *
	 * 艾利克（エリック）
	 *
	 * 雷西斯（レジス）
	 *
	 * 賽思
	 *
	 */
	['撒夫乌|苏飞魯|苏菲尔|萨夫乌|苏菲路', '苏菲尔'],
	['索菲亞|苏菲亞|苏菲雅', '索菲亞'],
	[`索菲亞${sp}苏菲尔`, '$1・苏菲尔'],
	['卡尔洛斯|卡洛斯', '卡洛斯'],
	['艾丽泽|愛莉婕|艾丽婕|愛丽舍', '愛莉婕'],
	['埃里克|艾利克|埃利克', '艾利克'],

	['雷西斯|雷吉斯', '雷西斯'],

	/**
	 * 蒂娜
	 * 丽安娜
	 *
	 * 艾尔莎
	 */
	['丽恩娜|丽安娜', '丽安娜'],
	['艾尔莎|艾露莎', '艾尔莎'],

	/**
	 * 格兰普（グランプ）
	 * 帕特里克 卢德韦尔子爵
	 *
	 * 約瑟夫
	 *
	 * 洛莉（ローリィ
	 * 玛雅（マヤ）
	 *
	 * 古兰普家的当主克雷因
	 *
	 * ヴェスタ街道
	 *
	 * 利铎尔希姆
	 *
	 * 欧文（オーウェン）
	 * 弗路弗拉德侯爵家（フルフラット侯爵家）
	 *
	 * ペタン
	 *
	 */
	['格兰普|古兰普|庫兰普', '古兰普'],

	['克莱因|克雷因', '克雷因'],
	['洛莉|洛利', '洛莉'],

	['帕特利庫|帕特里克', '帕特里克'],
	['卢德韦尔|卢德維尔', '卢德維尔'],
	[`帕特里克${sp}卢德維尔`, '帕特里克・卢德維尔'],

	['福利弗兰特|弗路弗拉德|フルフラット', '弗路弗拉德'],
	['欧溫|欧文|オーウェン', '欧文'],
	['ペタン|姵塔|沛妲', '姵塔'],

	/**
	 * 莎拉（サラ）
	 * 丹尼尔（ダニエル）
	 *
	 * 梅丽莎桑还有馬科斯桑
	 * 达尼埃路
	 *
	 * 利庫（リック）
	 * 蕾米（レミー）
	 *
	 * 瑞吉村
	 */
	['ヴェスタ|維斯塔', '維斯塔'],
	['萨拉|莎拉', '莎拉'],
	['达尼埃路|丹尼尔', '丹尼尔'],

	['飞机場幼女|贫乳幼女', '贫乳幼女'],
	['飞机場|貧乳', '貧乳'],

	['瑞克|利庫|里克', '利庫'],
	['蕾咪|蕾米', '蕾米'],

	['雷吉村|瑞吉村', '瑞吉村'],

	['馬克思|馬科斯|麦克斯|馬克斯', '馬科斯'],

	/**
	 *
	 * 莉泽洛蒂
	 * 阿尔貝尔德・冯・利泽露希姆
	 *
	 * 威尔斯的西服店
	 *
	 * 愛莎
	 *
	 * 茜。《庫拉乌特》商会当家女儿
	 * 特雷弗
	 * 利茲
	 *
	 * 艾米。作为威尔斯西服店的女儿
	 */
	['利泽洛特|莉泽洛蒂', '莉泽洛蒂'],
	['莉茲|利茲', '莉茲'],
	['阿尔伯特|阿尔貝尔德|阿尔貝特', '阿尔貝尔德'],

	['利铎尔希姆|利泽露希姆|丽泽尔希姆|利泽尔希姆|里泽尔赫姆|利泽尔海姆', '利泽露希姆'],
	[`${sp}冯${sp}利泽露希姆`, '・冯・利泽露希姆'],

	['威尔斯', '威尔斯'],

	/**
	 * 瑞利庫（レリック）
	 * 特雷弗
	 *
	 * 監督的吉列姆
	 *
	 * 第一公主諾艾露
	 *
	 */
	['瑞力克|瑞利庫', '瑞力克'],
	['梅森', '梅森'],
	['內森', '內森'],

	/**
	 * ホーンラビット
	 */
	['独角兔|ホーンラビット', '独角兔'],
	['精霊', '精靈'],
	['(咖|珈|伽)魯熊', '伽魯熊'],
	['(琉|硫)克(斯|司)(咖|珈|伽)魯熊|硫克斯珈魯熊', '琉克斯伽魯熊'],

	/**
	 *
	 */
	['穆勒平原|弥勒平原', '穆勒平原'],

	/**
	 *
	 */
	['Sama|撒麻', '桑'],
	['奴里|奴隷', '奴隷'],
	['想象|想像', '想像'],
	['対像|對象', '對象'],
	['領地|領土', '領地'],
	['登入|登録', '登録'],
	['後宮', '後宮'],

	['紋様?魔(術|法)|纹飾魔(術|法)|刻印魔术', '紋様魔術'],
	['(黒|白)魔(術|法)', '$1魔術'],

	['魔(術|法)', '魔術'],
	['管家|执事', '执事'],
	['玛娜|Mana|法力', '玛娜', 'ig'],

	['精灵の里', '精灵の里'],
	['内政作弊|内政外挂', '内政作弊'],

	...lazymarks['class'],

	...lazymarks[4],

	[/(\S)\n(─+[ ]*[^─\n]+)/gm, '$1\n\n$2'],
	[/^(─+[ ]*[^─\n]+)\n(\S)/gm, '$1\n\n$2'],
	[/（“▔/gm, '（▔'],
	[/￣“）/gm, '￣）'],
	[/<“）/gm, '<）'],

	[/^[　\t ]+/gm, ''],

	[/([=─]+)(?:作者的话|作者原话)([=─]+)/g, '$1$2'],

	_word_en(/\d+/g, function (...m)
	{
		return m[1] + StrUtil.toFullNumber(m[2]);
	}),

	_word_en(/[a-z]/ig, function (...m)
	{
		return m[1] + StrUtil.toFullEnglish(m[2]);
	}),

	...lazymarks[0],
	...lazymarks[1],
	...lazymarks[2],
	...lazymarks[3],
	...lazymarks[5],

]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
