/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe, sublib } from './index';
import * as StrUtil from 'str-util';

/**
 * 改成小說名字
 */
export const lang = '再臨勇者の復讐譚　～失望しました、勇者やめて元魔王と組みます～';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = sublib._word_zh_all([

	['伊織', '伊織'],
	['天月伊織', '天月伊織'],
	['阿馬茨|アマツ|阿玛茨|啊玛茨', '阿瑪茨'],

	/**
	 * 艾路菲斯扎库·吉尔德伽尔多
	 *
	 * 佩罗莉亚酱
	 *
	 * 夏蕾
	 */
	['艾路菲斯扎庫?|エルフィスザーク|艾兒菲絲扎庫|艾兒絲菲薩克|艾兒菲斯扎庫|艾兒菲斯扎克', '艾兒菲絲扎庫'],
	['吉尔德伽尔多|ギルデガルド|吉尔德伽尔多', '吉尔德伽尔多'],
	[`艾兒菲絲扎庫${sp}吉尔德伽尔多`, '艾兒菲絲扎庫・吉尔德伽尔多'],

	['艾兒菲|艾路菲|艾魯菲|艾露菲|艾尔菲|菲尔路|エルフィ', '艾兒菲'],

	/**
	 * 欧宁王国
	 * 琉薩斯・基爾巴恩
	 * 王都布雷昂
	 */
	['欧宁|オンリィン', '欧宁'],

	['艾依茨|アイツ', '艾依茨'],
	['布雷勇|布雷昂', '布雷昂'],

	/**
	 * 連合国・温泉都市
	 */
	['喵美露|喵梅尔|喵梅露', '喵梅露'],
	['米莎|美莎|米夏', '米莎'],

	['祖魯茨|卓卢金', '祖魯茨'],

	[`卓卢金${sp}多尤拉喜`, '卓卢金・多尤拉喜'],

	/**
	 * 瑪溫・優哈內斯
	 * 迪奧尼斯・魯巴路庫
	 */
	['迪奧尼斯|ディオニス|戴奧尼斯|迪米尼絲|迪尼斯|迪奧尼絲|迪安尼斯|迪昂尼斯', '迪奧尼斯'],
	['ルーバルク|魯巴路庫', '魯巴路庫'],
	[`迪奧尼斯${sp}魯巴路庫`, '迪奧尼斯・魯巴路庫'],

	['貝魯托加|布魯托加|艾魯托加|ベルトガ', '貝魯托加'],

	['露西皮娜|ルシフィナ|露西芙娜|露西菲娜|露西皮那|魯西菲娜', '露西芙娜'],

	['琉泽苏|リューザス|琉澤蘇|琉薩斯|流泽苏', '琉薩斯'],
	['基尔波恩|基爾巴恩|吉爾伯恩利', '基爾巴恩'],
	[`琉薩斯${sp}基爾巴恩`, '琉薩斯・基爾巴恩'],
	[`琉薩斯基爾巴恩`, '琉薩斯・基爾巴恩'],

	[`(?:馬文|瑪溫|默溫|馬林)`, '馬文'],

	[`(?:馬文|瑪溫|默溫)${sp}(?:约翰内斯|優哈內斯|尤哈涅斯)`, '馬文・约翰内斯'],

	[`(?:奧利維亞|奧莉維亞|奧了利維亞)`, '奧莉維亞'],
	[`(?:艾利維斯蒂爾|艾利維絲蒂尔|艾利維斯蒂爾)`, '艾利維絲蒂爾'],
	[`(?:奧利維亞|奧莉維亞)${sp}(?:艾利維斯蒂爾|艾利維絲蒂尔)`, '奧莉維亞・艾利維絲蒂爾'],

	['拉菲澤|レフィーゼ|魯菲澤', '拉菲澤'],
	['グレゴリア|古硫多利雅', '古硫多利雅'],

	[`拉菲澤${sp}古硫多利雅`, '拉菲澤・古硫多利雅'],

	['格蕾西亞|グレイシア', '格蕾西亞'],
	['蕾法坦恩|レーヴァテイン', '蕾法坦恩'],

	/**
	 * 达魯多斯帝国
	 * 卡伦・雷福特
	 * 卡伦大人的随从，让
	 *
	 * 卡修・雷福特
	 *
	 * 奧利維亞・艾利維斯蒂爾
	 *
	 * 达魯多斯帝国，帝都梵戴尔。
	 *
	 * 梅尔墨特
	 */
	['雷福特|弗雷特|萊福特?|雷福德', '雷福特'],
	['卡伦|卡蓮|カレン|花蓮', '卡蓮'],

	['城(殻|殼|壳)(都|城)市', '城殻都市'],
	['拉姆', '拉姆'],

	['梅尔墨特', '梅爾墨特'],
	['讓', '讓'],

	['達魯多斯|ダルドス|達爾斯德', '達魯多斯'],

	/**
	 * 欧魯特吉亞・梵・扎尔菲尔德
	 * 歐路特吉亞.凡.扎尔菲尔德
	 */
	['歐路特吉亞|オルテギア|欧魯特吉亞', '歐路特吉亞'],
	[`${sp}(?:梵|凡)${sp}扎尔菲尔德`, '・梵・扎尔菲尔德'],
	[`${sp}(?:梵|凡)${sp}`, '・梵・'],

	/**
	 * 烏魯各斯森林
	 */
	['雷特西亞|レイテシア|雷提西亞|莱特娅|魯特西亞|雷德薩', '雷特西亞'],
	['深渊迷宫|奈落迷宮', '奈落迷宮'],
	['煉獄迷宮', '煉獄迷宮'],
	['(乌魯古斯|烏魯各斯)之?森林?', '烏魯古斯之森'],

	/**
	 *
	 */
	['隷属魔術', '隷属魔術'],
	['人狼', '人狼'],
	['召喚陣', '召喚陣'],
	['岩洞龙|岩窟龍', '岩窟龍'],

	['破坏魔法|壊魔', '壊魔'],
	['魔毀封殺', '魔毀封殺'],
	['茧玉|繭玉', '繭玉'],
	[`魔眼${sp}灰燼爆`, '魔眼・灰燼爆'],
	[`魔眼${sp}重圧潰`, '魔眼・重圧潰'],
	[`魔腕${sp}壊裂断`, '魔腕・壊裂断'],
	[`治愈|治癒`, '治癒'],
	[`崩坏巨桩|崩杭|崩坏之桩`, '崩杭'],
	[`因果返葬|因果反葬`, '因果返葬'],
	[`喪失魔術|失落魔術`, '喪失魔術'],
	[`印象魔術|心象魔術|印像魔術`, '心象魔術'],
	[`聯合国|同盟国|連合国`, '聯合国'],
	[`魔技簒奪|魔技簒奪`, '魔技簒奪'],
	[`鬼的指甲|鬼之爪`, '鬼之爪'],
	[`洗脳魔術|洗脑魔術`, '洗腦魔術'],

	[`強魔の?(戒指|手镯|腕貫|腕輪|指輪)|強魔の?指輪|強魔の?腕貫`, '強魔戒指'],
	[`防魔の?(戒指|手镯|腕貫|腕輪|指輪)|防魔の?腕輪|防魔の?戒指`, '防魔手镯'],

	['工会|公会|行会', '公会'],
	['宿驛|旅館', '旅館'],

	...sublib.lazymarks['class'],

	[/^[　 ]/gm, ''],

	[/(\d+)/g, function (...m)
	{
		return StrUtil.toFullNumber(m[1]);
	}],

	[/([^\w\u00C0-\u017F\.μ・·?‧•―-])([a-z])(?![\w\u00C0-\u017F\.μ・·?‧•―-])/ig, function (...m)
	{
		return m[1] + StrUtil.toFullWidth(m[2]);
	}],

	...sublib.lazymarks[4],

	...sublib.lazymarks[0],
	...sublib.lazymarks[1],
	...sublib.lazymarks[2],
	...sublib.lazymarks[3],
	...sublib.lazymarks[5],

	[/[\[【]/g, '「'],
	[/[\]】]/g, '」'],

	[/[《{]/g, '『'],
	[/[》}]/g, '』'],

]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
