/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe, sublib } from './index';
import * as StrUtil from 'str-util';
import { _word_en3, lazymarks, _word_jp1 } from './lib/index';

/**
 * 改成小說名字 (可留白 則自動設定為檔案名稱)
 */
export const lang = '';

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words_source: IWords[] = [

	_word_jp1('エレナ|埃列娜|艾蕾娜|伊莉娜|艾蓮娜', '伊莉娜'),
	_word_jp1('ロゼ|羅斯|羅榭|羅賽|蘿莎|羅澤|蘿澤', '羅榭'),

	[`伊莉娜${sp}羅榭`, '伊莉娜・羅榭'],

	_word_jp1('アインス|愛因茲|安因斯|阿尼斯', '愛因茲'),
	_word_jp1('ベルトナー|貝魯托那|貝爾托納', '貝爾托納'),

	[`愛因茲${sp}貝爾托納`, '愛因茲・貝爾托納'],

	_word_jp1('ゾルテ', '佐爾忒'),

	/**
	 *
	 */

	_word_jp1('ビエナート|比耶納德|畢安納多|比耶納德|碧艾納特', '畢安納多'),

	_word_jp1('グイレゴリウス|格雷戈里|古利哥尼斯', '古利哥尼斯'),

	_word_jp1('エンプレス', '安普納斯'),
	_word_jp1('レガリア', '雷加利亞'),

	/**
	 *托阿魯·洛社
	 */
	_word_jp1('ベナン|貝娜|貝蘭', '貝娜'),

	_word_jp1('ノルト', '諾爾托'),

	_word_jp1('ノルン', '羅倫'),
	_word_jp1('ガラート|加華持|加華特|卡烏托', '加華特'),

	_word_jp1('レイリオ|里依尼奧|里伊尼奧|雷里歐|雷奧|雷尼奧|雷利歐', '雷里歐'),

	_word_jp1('クレスト', '克里斯托'),


	/**
	 *
	 */
	_word_jp1('リドア|里利多阿|利多阿', '利多阿'),

	_word_jp1(`バリトン${sp}ベイ`, '巴里彤・貝'),

	_word_jp1('ラドック|拉多克|朗多夫', '拉多克'),
	_word_jp1('ミローズ|米偌斯|米洛茲', '米洛茲'),
	_word_jp1('カロッソ|加羅桑|卡倫', '加羅'),

	/**
	 *
	 */
	_word_jp1('瑪露提那|マルテナ|馬魯特納|瑪露提納|瑪魯提那', '瑪露提納'),

	[`ユータス${sp}ヒルト`, 'ユータス・ヒルト'],

	/**
	 *
	 */
	_word_jp1('オーランド|奧蘭多|奧蘭度', '奧蘭多'),
	_word_jp1('華以斯華修|ライズワース|萊斯瓦斯|萊茲沃斯', '萊茲沃斯'),
	_word_en3('Raizuwasu', '萊斯瓦斯'),

	_word_jp1('グレイスワール', '格雷斯瓦爾'),
	_word_jp1('ノーデンヒルト', '諾第希爾德'),

	_word_jp1('ロメル|隆梅爾|羅梅爾', '羅梅爾'),
	_word_jp1('アーチ', '亞奇'),

	_word_jp1('ベルノルト', '別魯若托'),

	/**
	 *
	 */
	_word_jp1('双刻の月', '雙刻之月'),

	_word_jp1('蕾蒂西亞|レティシア|雷蒂希雅|蕾蒂希雅', '蕾蒂希雅'),
	_word_jp1('梅爾菲斯|メルヴィス|メルビィス|梅魯佩斯', '梅爾菲斯'),

	_word_jp1('シェルン|杰爾倫|夏倫|榭倫', '夏倫'),
	_word_jp1('卡達托|カダート', '卡達托'),

	[`(?:蕾蒂希雅|夏倫|卡達托)${sp}梅爾菲斯`, '$1・梅爾菲斯'],

	_word_jp1('卡塔莉娜|カタリナ', '卡塔莉娜'),
	_word_jp1('繆斯|ミューズ', '繆斯'),

	[`卡塔莉娜${sp}繆斯`, '卡塔莉娜・繆斯'],

	_word_jp1('エクルートナ|耶庫魯多納|艾克爾托納', '艾克爾托納'),

	/**
	 *
	 */
	_word_jp1('砂塵の?大鷲', '砂塵之大鷲'),

	_word_jp1('ヴォルフガング|奧爾夫岡|波爾夫岡', '波爾夫岡'),
	_word_jp1('バーナード', '巴納德'),

	/**
	 * 伊文·尤哈斯
	 * 德里克·阿德斯
	 * 阿爾芒·阿魯巴
	 */
	_word_jp1('黄昏の獅子', '黃昏的獅子'),
	[`(?:エドラット|愛德拉托)${sp}(?:モス|摩斯)`, '愛德拉托・摩斯'],

	_word_jp1('アンゼルム', '阿塞爾姆'),
	_word_jp1('アヒム', '奧黑姆'),

	[`阿塞爾姆${sp}奧黑姆`, '阿塞爾姆・奧黑姆'],

	_word_jp1('アウグスト', '奧古斯都'),
	_word_jp1('貝魯托尼亞斯|貝爾托利斯|皮特里亞斯|皮特利亞斯|ベルトリアス', '貝魯托尼亞斯'),

	[`(?:奧古斯都)${sp}(?:貝魯托尼亞斯)`, '奧古斯都・貝魯托尼亞斯'],

	[`(?:哈桑)${sp}(?:塞魯托里歐)`, '哈桑・塞魯托里歐'],


	[`德里克${sp}阿德斯`, '德里克・阿德斯'],


	_word_jp1('伊文|伊萬', '伊文'),
	[`伊文${sp}(?:尤|亞)哈斯`, '伊文・尤哈斯'],

	_word_jp1('阿爾芒|アルマン|阿爾曼', '阿爾曼'),
	_word_jp1('阿爾伯特|アルバート|阿魯巴', '阿爾伯特'),

	[`阿爾曼${sp}阿爾伯特`, '阿爾曼・阿爾伯特'],


	/**
	 * 艾德法魯多·愛克諾斯
	 * 艾德
	 * 阿尼艾絲·阿布尼魯
	 */
	_word_jp1(`アニエス|阿尼艾斯|阿尼艾絲`, '阿尼艾絲'),

	[`阿尼艾絲${sp}阿布尼魯`, '阿尼艾絲・阿布尼魯'],

	_word_jp1(`艾德法魯多`, '艾德法魯多'),

	/**
	 *
	 */
	_word_jp1(`ベニート`, '別尼多'),
	_word_jp1(`アギーレ`, '安吉烈'),

	_word_jp1(`シュレイ|艾修利|艾休利`, '艾休利'),

	[`艾休利${sp}貝托尼`, '艾休利・貝托尼'],
	[`艾特莉${sp}貝托尼`, '艾特莉・貝托尼'],

	/**
	 *
	 */
	[`魯本斯${sp}菲里歐`, '魯本斯・菲里歐'],

	/**
	 *
	 */
	_word_jp1('瓦倫加爾特|ファーレンガルト|法倫加魯托', '瓦倫加爾特'),

	_word_en3('Farengaruto', '瓦倫加爾特'),

	_word_jp1('瓦倫加爾特(聯盟|聯邦)', '瓦倫加爾特聯邦'),

	_word_jp1('サクシャリア', '薩克沙利亞'),

	_word_jp1('ニールバルナ|尼爾巴魯納|尼爾瓦爾納', '尼爾瓦爾納'),

	_word_jp1('法魯托', '法魯托'),

	_word_jp1('アドラトルテ|阿德拉托魯特', '阿德拉托魯特'),

	/**
	 *
	 */


	/**
	 *
	 */
	_word_jp1('羅薩利亞|ロザリア|羅薩莉婭', '羅薩利亞'),
	_word_jp1('ブルムデリク', '布魯姆迪利克'),

	/**
	 *
	 */
	_word_jp1('シュメリア', '蘇梅利爾'),

	_word_jp1('貝爾薩利亞', '貝爾薩利亞'),
	_word_jp1('ノートワール', '諾特瓦爾'),

	/**
	 *
	 */
	_word_jp1('カテリーナ|卡特蓮娜|卡特琳娜', '卡特琳娜'),
	_word_jp1('エリーゼ|愛麗絲|艾琳瑟|艾莉瑟|艾莉絲', '艾琳瑟'),
	_word_jp1('アウストリア|奧斯利亞', '奧斯利亞'),

	[`(?:艾琳瑟)${sp}(?:奧斯利亞)`, '艾琳瑟・奧斯利亞'],

	_word_jp1('ダランテ|達蘭迪|達蘭提', '達蘭提'),

	_word_jp1('アテイル', '阿提爾'),
	_word_jp1('(?:アテイル|阿提爾)の聖杯', '阿提爾的聖杯'),


	['宣託の騎士団', '宣托騎士團'],
	_word_jp1('カインド・オブ・フォーラウンズ', 'カインド・オブ・フォーラウンズ'),


	_word_jp1('ヴェッテーヤ', '貝特利亞'),
	_word_jp1('ライデリン', '萊依澤琳'),

	[`(?:阿魯|アル)${sp}(?:卡拉米斯|カラミス)`, '阿魯・卡拉米斯'],
	_word_jp1(`エルマリュート`, '艾露瑪露托'),

	/**
	 *
	 */
	_word_jp1('アンダーマン', '安達曼'),
	_word_jp1('艾安里巴', '艾安里巴”'),

	_word_jp1('鉄の蜥蜴', '鐵蜥蜴'),
	_word_jp1('背徳の蠍', '背徳之蠍'),

	_word_jp1('污穢的殉職者|不潔的殉職者|穢之殉教者', '污穢的殉職者'),

	[`アンダーズ${sp}ペイン`, '污穢的殉職者'],

];

/**
 * 實際使用的取代樣式
 */
export const words: IWords[] = sublib._word_zh_all([

	...words_source,

	[/^[　 ]+/gm, ''],

	['協會', '公會'],

	...sublib.lazymarks['class'],
	//...sublib.lazymarks['zh_cht'],

	//...sublib.lazymarks['unit'],

	...sublib.lazymarks[4],

	...sublib.lazymarks['full_width_001'],
	...sublib.lazymarks['full_width_002'],

	...sublib.lazymarks[0],
	...sublib.lazymarks[1],
	...sublib.lazymarks[2],
	...sublib.lazymarks[3],
	...sublib.lazymarks[5],

	...sublib.lazymarks[8],

] as IWords[]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

/**
 * 其他用途
 *
 * @deprecated
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

export default exports;
