/**
 * Created by user on 2017/12/18/018.
 */

import { sp } from '.';

export const lang = '四度目は嫌な死属性魔術師';

export const value = {
	chapter_id: '第{{0, toFullNumber}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,
};

export const words = [

	//达露西亚 ダルシア
	['[达達]露西[亞亚]|[妲妲][爾尔][希希][亞亚]', '达露西亞'],
	[/[範范班泛班](?:[達达達]?[爾尔鲁魯贝]|[贝達达達][爾尔鲁魯]?)/g, '班达鲁'],
	[/[範范班泛班](大人|身邊|君)/g, '班$1'],
	[/([，。！、【一])[範范班泛班]([一，。！、])/g, '$1班$2'],

	// 女僕
	['[沙莎薩萨][利莉][娅雅亚亞]', '沙利娅'],
	['丽塔|麗塔', '丽塔'],
	['萨姆|薩姆', '薩姆'],

	[/GHOUL/ig, 'GHOUL'],

	//食屍鬼/古尔
	['[薩萨][緹蒂][莉莉][絲斯]', '薩蒂莉斯'],
	['巴[絲斯絲][提蒂蒂][亞亚]', '巴斯蒂亞'],
	['维格罗|維賈羅', '维格罗'],

	['塔[利蕾雷莉][亚亞]', '塔利亞'],

	['卡[奇契][亚亞]', '卡奇亞'],

	//ビルデ_(協助研究食屍鬼少子化的女食屍鬼_食屍鬼)
	['毕露媞|妣耳跌', '毕露媞'],

	/**
	 * 新生 #37 #99
	 *
	 * ブラガ 布拉格 BLACK GOBLIN(黑哥布林)
	 *
	 * 則曼多 ゼメド 泽米多 ANUBIS(阿努比斯) 哥
	 * メメディガ 媚媚蒂嘉 梅美迪嘉 ANUBIS(阿努比斯) 妹
	 *
	 * 伯格 ANUBIS(阿努比斯)
	 *
	 * ゴーバ 戈巴 ORCUS(奥库斯)
	 *
	 * #49
	 *
	 * 嘉妲露|佳妲爾 ジャダル
	 */
	['布拉卡|布拉格', '布拉格'],

	['嘉妲露|佳妲爾|伽达尔|伽达尔', '嘉妲露'],

	//
	//拉批艾薩裘和亞瑪妲

	/**
	 * パウヴィナ (活死人偽轉生_高貴豬頭人混血) 帕烏維納 女
	 * 維比(ヴァービ)
	 * 拉比艾薩裘(ラピエサージュ) 女 #54
	 */
	['拉[批比]艾[薩萨]裘', '拉比艾薩裘'],
	//骸骨要塞 骨人
	['酷諾翰|庫諾漢|克诺亨|庫諾漢', '庫諾漢'],
	['維比|范彼', '維比'],

	/**
	 * 蟲
	 *
	 * 比多|皮特
	 * 培因
	 */
	['比多|皮特', '皮特'],

	//史萊姆
	['奇尤魯|可爾', '可爾'],

	/**
	 * 巨人
	 *
	 * ザンディア_(巨人族英雄《小小天才》_第二王女_全屬性適應_殭屍) 桑提亞
	 * ジーナ_(巨人族英雄《聖女》_原祭司長_殭屍) 吉娜
	 * ダタラ_(巨人族鍛造師_殭屍) 達塔拉
	 * ズラン_(巨人族斥侯轉忍者_殭屍) 茲蘭
	 */
	['波庫斯|博克斯|沃尔克斯', '沃尔克斯'],
	['努阿扎|努阿[薩萨]', '努阿扎'],

	['[蕾雷][比碧][亞亚雅]|利维亞', '蕾比雅'],

	//
	['艾赞|艾善', '艾赞'],

	//人
	['[路鲁][切奇][里里][亞亚][诺諾]', '鲁奇里亞诺'],

	//吸血鬼
	['特涅西[亞亚]', '蒂尼西亞'],
	['爱莲|艾蓮', '爱莲'],
	['比爾凱因|比尔凯恩|彼鲁凯因|彼尔凯因', '比尔凯恩'],
	['比古巴蒙|谷巴蒙|古巴蒙', '谷巴蒙'],
	['蓓爾蒙多|贝尔蒙德', '贝尔蒙德'],

	/**
	 * 神
	 */
	['[羅罗]多(可爾特|特鲁特)', '罗多特鲁特'],
	['阿尔达|阿魯達', '阿尔达'],
	['非非流修咯咯', '西里酥卡卡'],

	[`邪神${sp}巴魯魯夏培`, '邪神・巴魯魯夏培'],

	//魔王古杜兰斯
	['古督拉尼斯|古杜兰斯', '古杜兰斯'],

	// フィトゥン => fitun => 菲頓
	['电场|场电|菲頓|fitun', '菲頓'],
	['雷电之神', '雷雲の神'],

	//梅雷佩贝尔

	['[維][妲达塔]', '维达'],
	['维达新種(?!族)', '维达新種族'],
	['维达的皇子', '维达的御子'],

	['[薩萨]卡特|寨卡特', '寨卡特'],
	['米亥尔|米海耶爾', '米亥尔'],

	/**
	 * 五惡龍神?菲提魯古（五悪龍神フィディルグ）與暴邪龍神?魯維茲馮爾
	 * 龍皇神?瑪爾敦庫
	 */

	['海茵茲|海因茨|海恩兹', '海因茨'],

	//卢卡斯

	['卡爾康|卡尔坎', '卡尔坎'],

	// 理刻連多

	// 達塔拉
	// 拉批艾薩裘
	//帕烏維納

	// 卡西姆
	['卡希姆|卡西姆', '卡西姆'],
	['[費费菲][斯施斯][塔特塔]', '费施特'],
	['傑諾|泽诺', '泽诺'],
	['[莉丽莉][奈娜娜那]', '丽娜'],
	['丽(─+)娜', '丽$1娜'],

	// 将军 / 宰相
	['切[札萨薩][列雷]', '切薩雷'],

	['拉伊蘭度|奈茵蘭多', '拉伊蘭度'],

	//尼阿奇鎮（ニアーキの町）：哈托納公爵領，遇到海茵茲的城鎮，dead907閣下翻作"米納其"
	['尼阿奇|米納其|米纳其', '米納其'],

	['塔罗斯海姆|塔洛斯海姆|塔洛海姆斯', '塔洛斯海姆'],

	//薩烏隆公爵領
	['绍恩|[薩萨][烏乌][隆罗]', '薩烏隆'],

	//哈托納公爵領

	//巴爾切布魯古

	// 阿密多帝國
	// 馬修庫札爾・馮・貝爾烏德・阿密多
	// マシュクザール・フォン・ベルウッド・アミッド
	['[亚亞阿]密[特多]', '阿密特'],

	['冯|馮', '馮'],
	['贝武多|貝爾烏德', '贝武多'],
	['馬修庫札爾|玛修克札鲁|玛仕库扎尔', '馬修庫札爾'],

	// 選王國
	['歐爾巴烏姆|欧鲍姆|奥卢邦', '奥卢邦'],

	//米爾古盾國
	['(?:米爾|米鲁)[古固]盾[国國]', '米鲁固盾国'],

	/**
	 * 巴恩蓋亞大陸南部
	 */
	['邦盖亚|巴恩蓋亞', '巴恩蓋亞'],

	/**
	 * 山铜（古希腊语：Ὀρείχαλκος， 英语：Orichalcum，又译奧利哈鋼、俄瑞卡尔科斯、奥里哈鲁根、奧利哈康或王者金屬)
	 */
	['奧理哈鋼|奧里哈鋼|奧理哈康|歐利哈爾康|奧利哈鋼|山铜|奥里哈鲁根', '奧里哈鋼'],

	/**
	 * DUN #36
	 *
	 * 加朗之谷、多伦水宴洞、沃尔克斯亚龙草原、巴利肯减命山
	 */
	['巴里根减少的生命山|巴里根减命山|巴利肯减命山|巴里肯滅命山', '巴利肯减命山'],
	['杜蘭水宴洞|多伦水宴洞', '多伦水宴洞'],
	['加蘭之谷|加朗之谷', '加朗之谷'],
	['(波庫斯|沃尔克斯)[亞亚][龙龍]草原', '沃尔克斯亚龙草原'],

	// オリジン

	['Origin', 'ORIGIN', 'ig'],
	['Lambda', 'LAMBDA', 'ig'],
	['拉姆达|拉姆妲|拉姆達', '拉姆达'],
	['奥利俊|歐力金', '奥利俊'],

	//[`^　　`, '　', 'mg'],

	/**
	 * LAMIA(拉米亚：蛇女)、SCYLLA(锡拉：章鱼女)、ARACHNE(阿拉克尼：蜘蛛女)、CENTAURS(萨托斯：半人马)、HARPY(哈比：鸟身女妖)和魔人族
	 */
	['锡拉|斯库拉', '斯库拉'],

	/**
	 * 蜥人
	 */
	//傳奇蜥人戰士（リザードマンジェロニモ），夏咻加

	['勇士', '勇者'],
	['蜥蜴?人', '蜥人'],
	['(戰士|勇者|皇家衛士|騎兵)(蜥人)', '$2$1'],

	/**
	 * 豬頭人
	 */
	//噗咯剛

	//哥魯檔大祭司

	[`二米半`, '兩米半'],

	['畜力', '蓄力'],

	[`光${sp}生命属性`, '$1・$2'],
	[`神${sp}[魯菲瑪巴]`, '$1・$2'],
	[`勇者${sp}寨卡特`, '$1・$2'],

	['成保', '城堡'],
	['成強', '城牆'],

	['成原', '成員'],

	['死属性魅了', '死属性魅惑'],

	['甄别', '徵選'],

	['炮[术術]', '砲術'],
	['炮', '砲'],

	//鎗

	[`^${sp}((?:独特|主动|被动)技能)`, '・$1', 'mg'],
	[`^${sp}(名前|種族|年齢|二つ名|ジョブ|レベル|ジョブ履歴|能力値|パッシブスキル|アクティブスキル|ユニークスキル|魔王の欠片|呪い)`, '・$1', 'mg'],
	['选举王[国國]', '选王国'],

	['首相', '宰相'],
	['維目包', '為目的'],

	['統合人', '統管者'],

	[/\n+(\(￣▽￣\)"?|（￣）￣）↗|\(\*\/ω＼\*\))\n+/g, '\n\n$1\n\n'],

	['付上', '附上'],

	['解開實，', '解開時，'],
	['四肢成現', '四肢呈現'],
	['看來身前', '看來生前'],
	['進化灰飛', '進化會飛'],
	['馬車行不死', '馬車型不死'],
	['不死製者', '不死者'],

	[/GOLEM/ig, 'GOLEM'],
	['(魔[像象]|哥雷姆|哥雷魯|GOLEM)(?!\\(?(?:魔[像象]|哥雷姆|GOLEM))', '魔像'],

	['(晉|進)[階阶](?!)', '晉階'],
	['阶位|階位|位階|階級', '位階'],

	['<-', '←'],

	//['板金', '板金'],
	['的種板金', '的重板金'],

	['女將屍', '女殭屍'],

];

//GOLEM(魔像)

export const words_maybe = [
	// 將對主角用的用語改為 小家伙
	'小.?子',

	/(.{1,2})?(不死(?!者|巨人|骷髏|沃尔克斯|小虫|化|骷髅|虫|树魔|性))(.{1,2})?/g,
	'亞斯',

	'rank',

	'艾赞',

	'[範范班泛](?![達达達][爾尔鲁魯]|大人|[围圍疇于起畴])',

];

import * as self from './四度目は嫌な死属性魔術師';

export default self;
