/**
 * Created by user on 2017/12/18/018.
 */

import { sp } from '.';

export const lang = '四度目は嫌な死属性魔術師';

export const value = {
	chapter_id: '第{{0, toFullNumber}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,
};

export const words = [

	[/班達魯|班达鲁|范達爾/g, '班达鲁'],

	[/甄别/g, '徵選'],
	['炮[术術]', '砲術'],
	[`^${sp}((?:独特|主动|被动)技能)`, '・$1', 'mg'],
	[`^${sp}(名前|種族|年齢|二つ名|ジョブ|レベル|ジョブ履歴|能力値|パッシブスキル|アクティブスキル|ユニークスキル|魔王の欠片|呪い)`, '・$1', 'mg'],
	['选举王[国國]', '选王国'],

	// フィトゥン => fitun => 菲頓
	['电场|场电|菲頓|fitun', '菲頓'],
	['雷电之神', '雷雲の神'],

	['維目包', '為目的'],
	['維妲|维达', '维达'],
	['维达新種(?!)', '维达新種族'],

	//[`^　　`, '　', 'mg'],

	[`二米半`, '兩米半'],

	['特涅西亞', '蒂尼西亚'],
	['畜力', '蓄力'],

	[`邪神${sp}巴魯魯夏培`, '邪神・巴魯魯夏培'],
	[`光${sp}生命属性`, '光・生命属性'],

	// 選王國
	['歐爾巴烏姆|欧鲍姆|奥卢邦', '奥卢邦'],

	['海茵茲|海因茨', '海茵茲'],
	['比爾凱因|比尔凯恩', '比尔凯恩'],
	['比古巴蒙|谷巴蒙', '谷巴蒙'],

	['非非流修咯咯', '西里酥卡卡'],

	['成保', '城堡'],
	['成強', '城牆'],

	['阿尔达|阿魯達', '阿尔达'],

	['成原', '成員'],

	// 理刻連多

	// 達塔拉

	// 卡西姆
	['費斯塔|费施特', '费施特'],
	['傑諾|泽诺', '泽诺'],
	['莉奈|丽娜', '丽娜'],
	['丽(─+)娜', '丽$1娜'],

	// 塔蕾亞

	//罗多特鲁特

	//塔洛斯海姆

	//奈茵蘭多

	//薩烏隆公爵領

	//哈托納公爵領

	//米爾古盾國
	['(?:米爾|米鲁)[古固]盾[国國]', '米鲁固盾国'],

	// オリジン
	['Origin', 'ORIGIN', 'ig'],

	['Lambda', 'LAMBDA', 'ig'],

	['拉姆达|拉姆妲|拉姆達', '拉姆达'],
	['奥利俊|歐力金', '奥利俊'],

	['阿密特|阿密多', '阿密特'],

	// 阿密多帝國
	// 馬修庫札爾・馮・貝爾烏德・阿密多
	// マシュクザール・フォン・ベルウッド・アミッド

];

export const words_maybe = [
	// 小家伙
	'小.?子',

	/不死(?!者|巨人|骷髏|沃尔克斯|小虫|化|骷髅|虫)/,
	'亞斯',
];

import * as self from './四度目は嫌な死属性魔術師';

export default self;
