/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe, sublib } from './index';
import * as StrUtil from 'str-util';

/**
 * 改成小說名字
 */
export const lang = '奪う者　奪われる者';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = sublib._word_zh_all([

	//['要取代的字', '取代後的字'],

	//[`优`, '优'],
	[`(悠+)(?!哉)`, function (...m)
	{
		return '优'.repeat(m[1].length);
	}],
	[`(?:悠|优)${sp}佐藤`, '优・佐藤'],

	['斯特拉|史黛拉', '史黛拉'],

	['妮娜|妮那', '妮娜'],
	[`妮娜${sp}涅瓦`, '妮娜・涅瓦'],

	['蕾娜|莱娜|莉娜', '蕾娜'],
	[`蕾娜${sp}芙亞娜`, '蕾娜・芙亞娜'],

	['玛丽法', '玛丽法'],
	[`玛丽法${sp}娜古苏`, '玛丽法・娜古苏'],

	/**
	 *
	 */
	['耶亞溫|伊恩', '伊恩'],
	['納玛利|納馬利|娜玛丽(?!法)|納玛尼', '納玛利'],
	['特娅', '特娅'],

	['岚|籣', '岚'],
	['可羅|科罗', '科罗'],

	/**
	 *
	 */
	['納玛利|納馬利|娜玛丽(?!法)|納玛尼', '納玛利'],
	['卡姆莉|凯姆莉', '卡姆莉'],
	['玛茲皮|瑪茲皮', '玛茲皮'],
	['婆婆|奶奶', '奶奶'],

	['オトペ|奧陶倍|歐多沛', '歐多沛'],


	/**
	 *
	 */
	['卢瓦諾夫|魯瓦諾夫', '卢瓦諾夫'],
	['依毕卡|莉琵卡', '莉琵卡'],
	['芙拉維雅|芙拉維亞', '芙拉維亞'],
	['巴娜茉|玛納默', '巴娜茉'],

	['羆|羆|罴', '羆'],

	['梅兰妮|瑪納米', '梅兰妮'],

	['莫尼可|莫尼克', '莫尼可'],

	['亞姆|牙無', '亞姆'],
	['亞戈馮', '亞戈馮'],

	/**
	 * 利瑟鲁村
	 */
	['雷塞尔|利瑟鲁', '利瑟鲁'],

	/**
	 * 聖国
	 */
	['賈达尔克|贞德塔奴庫', '贞德塔奴庫'],
	['那姆卡|納姆卡', '納姆卡'],

	/**
	 * 自由国家
	 */
	['哈默尔(恩|嗯)|哈莫尔恩|哈梅伦', '哈默尔恩'],
	['基金山脉|奇金山脉', '奇金山脉'],
	['龙巢|竜之?巢', '竜之巢'],
	[`克里斯蒂${sp}沃尔顿`, '克里斯蒂・沃尔顿'],

	/**
	 * 卡莫
	 */

	['乌茲|伍茲', '乌茲'],
	['(乌|伍)，(乌|伍)茲', '乌，乌茲'],

	['卡玛|卡莫|加姆', '卡莫'],
	['卡莫都市|都市卡莫', '卡莫都市'],
	['慕卡|穆加', '穆加'],
	['拉利德|拉利特|拉力特', '拉利德'],
	['艾卡拉特|艾卡莱特', '艾卡莱特'],

	['(玛尔玛|玛璐玛)(?:(?:之|的)(森林?))', '玛尔玛森林'],

	['(?:利克里斯|利克利斯|匹克莉絲)(?:的?(酒吧))?', '利克利斯$1'],

	[`諾亞${sp}(?:帕茲斯|帕祖祖)`, '諾亞・帕茲斯'],

	[`皮埃特|皮耶特`, '皮耶特'],

	[`风向鸡亭|風向雞亭|風見鶏亭`, '风向鸡亭'],
	[`梅丽莎|梅莉塔`, '梅丽莎'],

	[`埃納尔`, '埃納尔'],

	[`警備会社|警備公司|保全公司|警备公司`, '警備公司'],
	[`阿卢寇姆|阿魯寇姆`, '阿卢寇姆'],
	[`阿卢寇姆警備公司|警備公司阿卢寇姆`, '警備公司阿卢寇姆'],

	/**
	 *
	 */
	[`(?:鹫梓|杰特)${sp}(?:多蓝|波兰)`, '鹫梓・多蓝'],

	[`克劳蒂雅|克劳蒂亞|克劳薇雅`, '克劳蒂亞'],
	[`克劳蒂亞${sp}(?:瓦尔伦德|巴尔林格|瓦伦伍德)`, '克劳蒂亞・瓦尔伦德'],

	[`拉拉|菝菝`, '拉拉'],
	[`拉拉${sp}(?:桐浦亞|登布拉)`, '拉拉・桐浦亞'],

	[`约瑟夫${sp}(?:幽魯姆|优魯姆|约魯姆)`, '约瑟夫・约魯姆'],

	/**
	 *
	 */
	[`莫非斯|莫菲斯`, '莫菲斯'],
	['阿黛尔', '阿黛尔'],
	['可蕾特|科莱特|柯莱特', '科莱特'],
	['芭尔芭拉|芭芭拉', '芭芭拉'],

	/**
	 * 昂斯加・佛德
	 * 昂斯加・罗特
	 */
	['佛德|罗特', '罗特'],

	/**
	 * 赤色流星
	 */
	['德利特|雷利特', '雷利特'],
	[`雷利特${sp}邦古`, '雷利特・邦古'],
	['红色流星|赤色流星', '赤色流星'],

	/**
	 *
	 */
	['莫?墨兰', '墨兰'],
	['貝儿|([^莫默])貝尔(?!德)', '$1貝儿'],

	/**
	 * 贵族
	 * 巴流・沃魯伊・諾克斯
	 * 巴流・奧魯・諾克斯
	 */
	['戈鲁巴多|格尔巴德', '格尔巴德'],
	['巴流|巴硫', '巴流'],
	[`${sp}(?:沃魯伊|奧魯)${sp}(?:諾克斯)`, '・奧魯・諾克斯'],

	['欧雷姆斯|布雷姆斯', '布雷姆斯'],

	['劳伦斯|勞倫斯', '劳伦斯'],

	/**
	 * 莫达利提教団
	 */
	['(因?莫达利提|不朽|因?莫达利亚|因达莫利提)教団', '不朽教団'],

	['克里亞|克利亞|戈利亞', '克利亞'],
	['多拉贡|多尔姆', '多拉贡'],
	['亞洁洛蒂|亞塞洛蒂|娅赛洛蒂', '亞洁洛蒂'],

	['不死的佣兵団|不死の?佣兵団', '不死的佣兵団'],

	['特佩|沛哲', '特佩'],
	['馬古諾特|馬格諾托', '馬古諾特'],

	['卡?波尔', '波尔'],
	['赛亞|瑟雅', '赛亞'],
	[`赛亞${sp}(?:罗斯|罗伯特)`, '赛亞・罗伯特'],

	/**
	 *
	 */
	['(泽多|赛特)共和国', '赛特共和国'],

	/**
	 *
	 */
	['莫貝尔|默貝尔', '莫貝尔'],



	/**
	 * 迷宫
	 */
	['腐界(?:之|的)?恩利欧|腐界(?:之|的)?因弥欧', '腐界的因弥欧'],
	['哥尔哥|戈尔多', '戈尔多'],

	['(?:骷髅|戈尔多)(?:之|的)?迷宫|ゴルゴの迷宮', '戈尔多的迷宫'],
	['(?:巴罗特|巴洛特|巴尔乐天)(?:之|的)?庭?(园|院)', '巴罗特庭园'],

	['(?:妖树|樹妖)(?:园|園)(?:之|的)?迷宫', '妖树园的迷宫'],

	['夏路朵(?:之|的)?密林|亞旮尔多(?:之|的)?密林', '夏路朵密林'],

	['虚幻之箱|空虚之箱', '空虚之箱'],
	['基路姆|格林姆', '格林姆'],


	/**
	 *
	 */
	['旭雷卡|赛卡', '旭雷卡'],

	['貝宁托斯|貝納图斯|ベナントス', '貝納图斯'],

	['西斯哈的坠饰|西斯哈的项炼', '西斯哈的项炼'],

	[`黑竜${sp}(?:牙|爪|烛)`, '黑竜・$2'],
	[`竜`, '竜'],

	/**
	 *
	 */

	(function ()
	{
		let jobclass = '(?:魔术师|盗贼|暗杀者|魔女|调教师|虫使)';

		return [`${jobclass}${sp}${jobclass}`, '$1・$2'];
	})(),

	['階級|級别', '階級'],
	['(斗|闘)技', '闘技'],
	['哥?(哥布尔|哥布林|歌布林)', '哥布林'],

	...([
		'LV',
		'HP',
		'MP',
	].map(function (value)
	{
		return ['([^\\w０-９Ａ-Ｚ])' + value.split('').concat('').join('[ ]?') + '(?![\\w０-９Ａ-Ｚ])', '$1' + StrUtil.toFullEnglish(value), 'ig'];
	})),

	[/([^\w\u00C0-\u017F\.μ・·?‧•―-])([\w])(?![\w\u00C0-\u017F\.μ・·?‧•―-])/g, function (...m)
	{
		return m[1] + StrUtil.toFullWidth(m[2]);
	}],

	//[/^([^\n\w]{2,3}?：[^\?\n]+)\?(?!\?)/gm, '$1・'],
	[/(：[^\?\n]+)\?(?!\?)/gm, '$1・'],

	[/^　+/gm, ''],

	[/\d+/g, function (s)
	{
		return StrUtil.toFullNumber(s);
	}],

	...sublib.lazymarks['class'],

	...sublib.lazymarks[4],

	...sublib.lazymarks[0],
	...sublib.lazymarks[1],
	...sublib.lazymarks[2],
	...sublib.lazymarks[3],
	...sublib.lazymarks[5],

]);

console.log(words);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
