/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe } from '.';
import * as StrUtil from 'str-util';

/**
 * 改成小說名字
 */
export const lang = '暗黒騎士物語　～勇者を倒すために魔王に召喚されました～';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '{{0}}',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0, toFullNumber}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = [

	['迪哈尔特|迪哈魯特|迪哈魯特|迪哈爾特|迪哈[ ]特', '迪哈魯特'],

	['黑樹|黑树', '黑树'],

	['京华|京華', '京华'],
	['加弥|加彌|嘉彌', '加弥'],
	['奈[绪緒]美?|奈?[绪緒]美', '奈緒美'],
	['憐侍|怜侍', '怜侍'],

	['古洛利西亞|古洛利亚斯|古洛利亞西|格洛里亚斯', '古洛利亚斯'],

	['奥迪斯|奧迪斯|奥里斯', '奧迪斯'],
	['黑博思|海博思', '海博斯'],
	['(?:赫伊波|海博)([斯思]?)', '海博$1'],

	['莫德斯|莫迪斯|莫德斯|モデス', '莫德斯'],
	['兰菲尔德|蘭菲爾德', '兰菲尔德'],
	['卢加斯|盧加斯', '卢加斯'],
	['达利欧|达里奧', '达利欧'],
	['納特|納托', '納特'],

	['古諾|古诺', '古诺'],
	['复莉', '夏莉'],

	['迪雅多娜|迪[亚亞]多娜|迪亞多娜', '迪雅多娜'],

	['扎爾基西斯|扎尔基西斯|札爾基西斯', '扎尔基西斯'],
	['拉维琉斯|拉布琉斯|拉夫鲁斯', '拉维琉斯'],

	['伊什(特?[蒂提][亚亞])', '伊什特蒂亚'],

	['丘比乌斯|裘皮乌斯', '裘皮乌斯'],
	['艾特莉|艾莉特|莉艾特', '莉艾特'],

	['莉潔娜|莉洁娜|利傑納|リジェナ', '莉洁娜'],

	['玛裘西斯|马丘西斯|馬丘西斯', '玛裘西斯'],
	['欧米洛斯|歐米洛斯', '欧米洛斯'],

	['塔拉波斯|塔拉博斯|タラボス', '塔拉博斯'],

	['艾奇古斯|埃奇苟斯', '埃奇苟斯'],
	['大关|戴甘', '戴甘'],

	['妲蒂艾|达提艾|韃媞艾', '妲蒂艾'],
	['戈兹|哥兹|哥茲', '哥茲'],
	['帕爾西斯|帕尔西斯', '帕尔西斯'],

	['库吉格|库奇古', '库吉格'],
	['吉安古|赞格|全古', '赞格'],

	['埃卡拉斯|艾卡拉斯|阿卡琉斯|阿喀琉斯', '埃卡拉斯'],
	['柯尔菲娜|克尔菲娜', '柯尔菲娜'],
	//菲莉欧娜

	['克拉蘇斯|克拉苏斯|庫拉斯|クラスス', '克拉苏斯'],

	['托魯瑪魯基斯|特馬爾基斯|トルマルキ', '托魯瑪魯基斯'],

	//诺维斯
	['戈丹|高登', '戈丹'],
	['希茲菲|希丝菲', '希茲菲'],

	['諾拉|娜拉', '娜拉'],
	['賈絲汀|贾丝廷|贾丝婷', '賈絲汀'],

	['阿特拉[娜納][库庫][雅娅拉]|埃托拉娜庫亞|阿特拉纳克亚?|阿特拉納庫拉', '阿特拉娜库雅'],
	['(阿特|艾朵|埃托)拉娜|アトラナ', '阿特拉娜'],

	['艾[烏乌]莉亞|艾薇利亚|尤莉亚|艾丽娅|艾歐莉亞', '艾烏莉亞'],

	['艾利奧斯|埃里奧斯|伊莱奥斯|裏奧斯', '艾利奧斯'],
	['納尔古尔|娜迩葛尔|娜尔葛尔|娜邇葛爾|纳尔戈尔|纳尔噶尔|納爾戈爾', '娜迩葛尔'],
	['贝洛斯|维洛斯|贝罗斯|洛克斯|韋羅斯', '维洛斯'],
	['阿爾戈亞|阿尔戈亚|阿戈[爾尔][亚亞]?', '阿尔戈亚'],
	['卡農|卡隆|卡伦', '卡隆'],

	['米濃|米浓|米农|米農|美農', '米浓'],

	['[圣聖]蕾娜莉[亚亞]?共和[国國]', '聖蕾娜莉亚共和国'],

	['萨里亚|萨莉亚', '萨里亚'],

	['阿裏亞德|亚利亚多|阿利亚德|亚利亚多|亞利亞多', '亞利亞多'],

	//阿里亚迪娜共和国
	['亞裡亞蒂亞|阿里亚迪娜|亞莉亞迪娜|亞里亞蒂亞|亚里亚蒂亚|阿里亚迪亚', '亞里亞蒂亞'],

	['[迪提][塞赛]西[亞亚]|泰瑟西亚', '迪塞西亞'],

	['帕西芭亞|帕西佩亚|帕西帕艾拉', '帕西芭亞'],

	['阿克伦|阿克隆|亚克隆|阿克倫', '阿克伦'],
	['キシュ', '基修'],

	['[烏乌]斯之?街', '烏斯之街'],

	//矮人 地精 哥布林
	['地精|哥布林', '哥布林'],
	['[奥奧][伽加]族?|食人魔', '食人魔'],
	['人狼|狼人', '人狼'],

	['狮鹫|格里芬', '狮鹫'],
	['鹫马|骏鹰|西伯格里夫', '鹫马'],
	['飞马|佩加索斯|珀伽索斯', '飞马'],

	//精灵
	['森精|妖精', '妖精'],

	['精靈', '精灵'],

	['米陶洛斯|弥诺陶洛斯|米諾陶洛斯', '米諾陶洛斯'],

	['戈雷姆', '哥雷姆'],

	['斯特里格斯|斯特里希斯', '斯特里希斯'],

	['勇士', '勇者'],
	['黑暗騎士|暗黑騎士', '暗黑騎士'],

	['锻冶|鐵冶', '锻冶'],

	['劍[の之的]乙女', '劍の乙女'],
	['黑髮[の之的]賢者(?:[ ](千雪))?', '黑髮の賢者$1'],

	['[国國]', '国'],
	['[圣聖]', '圣'],
	['[樹树]', '树'],

	[/\[女昌\]/g, '娼'],
	[/\[女支\]/g, '妓'],

	['丨', '!'],

	['\\([ ]+\\)', ''],

	// 視角
	[/^[・]([\u4E00-\u9FFF][^\n]+)$/gm, '◆$1'],
	[/^◆([\u4E00-\u9FFF][^\n]+)\n+/gm, '◆$1\n\n'],
	[/(\S\n)◆/g, '$1\n◆'],

	[/([^\d\.\+\-\* ／\/])(\d+)(?=[^\d\.\+\-\* ／\/])/g, function (...m)
	{
		return m[1] + StrUtil.toFullNumber(m[2]);
	}],

	[/[\!\(\):,~]/g, function (...m)
	{
		return StrUtil.toFullWidth(m[0], {
			skip: {
				space: true,
			},
		});
	}],

	[/^[ \t　]+/gm, ''],

	[/^([^\n"“”「」'\[\]［］]*)["“'\[［]([ ]*[…？－—\w０-９ａ-ｚＡ-Ｚ『』\u4E00-\u9FFF][^\n"“”「」'\[\]［］]*(?:\n[^\n"“”「」'\[\]［］]*)?)["”'\]］]/gm, '$1「$2」'],
	[/^([^\n"“”『』'‘’]*)["“'‘]([ ]*[…？－—\w０-９ａ-ｚＡ-Ｚ\u4E00-\u9FFF][^\n"“”『』'‘’]*)["”'’]/gm, '$1『$2』'],
	[/^([^\n【】<>]*)[<]([ ]*[…？－—\w０-９ａ-ｚＡ-Ｚ\u4E00-\u9FFF][^\n【】<>]*)[>]/gm, '$1【$2】'],

	[/(『[^『』\n]+』[^\n"“”『』'‘’]*)["“'‘]([ ]*[…？－—\w０-９ａ-ｚＡ-Ｚ\u4E00-\u9FFF][^\n"“”『』'‘’]*)["”'’]/gm, '$1『$2』'],
	[/(「[^「」\n]+」[^\n"“”「」'‘’]*)["“'‘]([ ]*[…？－—\w０-９ａ-ｚＡ-Ｚ\u4E00-\u9FFF][^\n"“”「」'‘’]*)["”'’]/gm, '$1「$2」'],

	[/^([^「」\n【】\[\]［］\{\}]*)[\[［\{]([ ]*[…？－—\w０-９ａ-ｚＡ-Ｚ\u4E00-\u9FFF][^\n【】\[\]］\{\}]*)[\]］\}]/gm, '$1【$2】'],
	[/(「[^「」\n【】\[\]［］]*)[\[［]([ ]*[…？－—\w０-９ａ-ｚＡ-Ｚ\u4E00-\u9FFF][^\n【】\[\]］]*)[\]］]/gm, '$1【$2】'],


	[/(【[^【】\n<>\[\]\{\}]+】[^\n【】<>\[\]\{\}]*)[<\[\{]([ ]*[…？－—\w０-９ａ-ｚＡ-Ｚ\u4E00-\u9FFF][^\n【】<>\[\]\{\}]*)[\]\}>]/gm, '$1【$2】'],

	[/[\[【“]/g, '「'],
	[/[\]】”]/g, '」'],

	[/(「[^」]*)「([^」]*)」/g, '$1『$2』'],

	[/([^】\n])(\n【[^\n]+】\n)/g, '$1\n$2'],
	[/(\n【[^\n]+】\n)([^【\n])/g, '$1\n$2'],

	[/\n[ 　]*\.[ 　]*(?=\n)/g, '\n'],

	[/\n+\-+\n*$/g, ''],

] as IWords[];

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

	'荣耀',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
