/**
 * Created by user on 2017/12/21/021.
 */

import lazymarks from '@node-novel/layout-pattern/lib/core/pattern/index';
import { _word_en, _word_en3, _word_jp1, _word_zh_all } from '@node-novel/layout-pattern/lib/core/word';
import { IWords, vMaybe, IWordsAll } from '@node-novel/layout-pattern/lib/core/word';
import { _zh_num2, sp, sp2, _zh_num, _full_num, EN_REGEXP } from '@node-novel/layout-pattern/lib/core/const';
import { IPatternRule } from '@node-novel/layout-pattern/lib/core/types';
import * as StrUtil from 'str-util';
import { _word_zh } from 'regexp-cjk/lib';

/**
 * 改成小說名字
 */
export const lang = '百魔の主';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}]) 「{{title}}」`,

	volume_id: '第{{0}}幕',
	volume_title: `$t(chapter_id, [{{0}}]) 【{{title}}】`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = _word_zh_all([

	['梅雷亞|梅列亚', '梅雷亞'],

	/**
	 * 弗兰达=库洛
	 * 术神（法郎达・克洛）
	 *
	 * 雷拉斯
	 * 雷拉斯=丽芙=雷缪泽
	 *
	 * タイラント
	 *
	 *
	 * 药王卡露拉=拉萨露的药指
	 * 风神（ヴァン＝エスター　范=艾斯塔）
	 */
	[`(?:弗朗达|弗兰达|法郎达|弗郎达|フランダー|佛郎达)`, '弗朗达'],
	[`(?:克洛|庫洛|クロウ)`, '庫洛'],
	[`(?:弗朗达|弗兰达|法郎达|弗郎达)${sp}(?:克洛|庫洛)`, '弗朗达=庫洛'],
	[`(?:弗朗达|弗兰达|法郎达|弗郎达)[=＝](?:克洛|庫洛)`, '弗朗达=庫洛'],

	['タイラント|泰戈尔', '泰戈尔'],

	['クルティスタ|忒什叶|庫魯緹斯塔|庫魯帝斯塔?', '庫魯帝斯塔'],
	['尼莉劳度|レイルノート', '尼莉劳度'],

	['灵山リンドホルム|リンドホルム灵山|靈山靈多霍爾姆|靈多霍爾姆靈山', '靈山靈多霍爾姆'],
	['リンドホルム|靈多霍爾姆|林霍尔姆', '靈多霍爾姆'],
	[`靈${sp}多${sp}霍${sp}爾${sp}姆`, '靈・多・霍・爾・姆'],

	['风神ヴァン＝エスターの六翼|风神の六翼|风神（ヴァン＝エスター　范=艾斯塔）的六翼|風神の六翼', '風神の六翼'],
	['六只翅膀|六翼', '六翼'],

	[`(?:卡露?拉)${sp}(?:納泽路|拉萨露)`, '卡露拉=拉萨露'],
	[`(?:卡露?拉)[=＝](?:納泽路|拉萨露)`, '卡露拉=拉萨露'],

	[`諾艾尔|諾埃尔`, '諾艾尔'],

	/**
	 * 【劍帝】艾尔伊泽家、【枪帝】加萨里斯家、【槌帝】高祖家、【弓帝】希尔家
	 *
	 * 艾鲁玛=艾鲁伊扎
	 *
	 * 艾斯
	 *
	 * シャウ 夏羽 夏羽=焦耳=舍伍德
	 リリウム＝アウスバルト＝クレール＝ミュウ莉莉乌姆 ＝阿乌苏巴萝多＝库雷鲁=缪

	 * 玛丽莎
	 *
	 * 《拳帝》名号的魔王。名字是『萨魯曼』
	 */
	['エルイーザ|艾尔伊泽|艾魯伊扎', '艾魯伊扎'],
	['艾露玛|艾鲁玛|Eruma|艾露瑪', '艾露瑪'],

	['莉莉乌姆|丽丽乌姆', '莉莉乌姆'],
	['萨魯曼|薩爾曼', '萨魯曼'],

	/**
	 * 魔劍クリシューラ
	 */
	['庫里修拉|クリシューラ|クリシュナ', '庫里修拉'],

	/**
	 * 雷缪泽
	 * 哈希姆=库德=雷缪泽
	 *
	 */

	/**
	 * 萨利亚斯=布拉德=姆萨克
	 * 萨利亞斯=布拉德=姆萨克
	 */
	['克薩克|姆萨克', '姆萨克'],
	['萨利亞斯|薩利亞斯|薩里亞斯', '萨利亞斯'],

	/**
	 *
	 */
	['菲萨利斯|法萨里斯|ファサリス|法薩裏斯|菲萨利斯', '菲萨利斯'],
	['菲尔露菲亞|斐拉鲁斐亚|フィラルフィア|斐拉魯斐亞', '菲尔露菲亞'],

	/**
	 *
	 */
	['キリシカ|吉莉西卡', '吉莉西卡'],

	/**
	 * 穆兰
	 * 库沙纳王国。
	 *
	 吉莉西卡
	 祖利亚王国。

	 法萨里斯
	 斐拉鲁斐亚王国。

	 哈希姆──雷缪泽王国。

	 萨伊萨里斯教国
	 *
	 * 蓼蓝的学园
	 *
	 * 『庫沙那王国』、『祖利亞王国』、『菲尔露菲亞王国』
	 *
	 * 穆兰=基尔=庫沙納
	 * 菲萨利斯=菲尔露菲亞
	 *
	 */
	['レミューゼ|remyu-ze|雷缪泽|雷繆澤', '雷繆澤'],
	['姆萨克|ムーゼッグ|Mu-Zeggu|Muzeggu', '姆萨克'],
	['塞夏里斯|萨伊萨里斯', '塞夏里斯'],
	['蓼蓝|伊达|艾奧斯|艾欧萨|アイオース', '艾奧斯'],
	['ネウス[＝=]ガウス?|内乌斯[=＝]高斯', '内乌斯=高斯'],
	['トット|都德', '都德'],
	['ズーリア|祖利亚', '祖利亞'],

	['庫沙那|库沙纳|クシャナ', '庫沙納'],

	['哉竹|扎伊德', '扎伊德'],


	['霊山', '靈山'],
	['英霊', '英靈'],
	['现象式|事象式', '事象式'],
	['魔石(砲|炮)', '魔石砲'],

	['術素', '術素'],
	['楽王', '楽王'],
	['転換期', '転換期'],
	['悪徳の?化身', '悪徳の化身'],
	['守财奴|金钱の亡者|金の亡者', '守财奴'],
	['黄金の?船', '黄金船'],
	['万癒術式', '万癒術式'],
	['薬(王|帝|神)', '薬$1'],
	['術機産業|魔法机械业|魔法机械产业', '術機産業'],

	['龙|竜', '竜'],

	['术', '術'],

	['〖', '『'],
	['〗', '』'],
	['◆[ ]+(?=◆)', '◆'],

	[/(\d+)/g, function (...m)
	{
		return StrUtil.toFullNumber(m[1]);
	}],

	...lazymarks['class'],

	[/^[ \t　]+/gm, ''],
	[/^【([^【】\n]+)】/gm, '「$1」'],
	[/(「[^「」【】\n]*)【([^「」【】\n]*)】/gm, '$1『$2』'],

	...lazymarks[4],

	...lazymarks[0],
	...lazymarks[1],
	...lazymarks[2],
	...lazymarks[3],
	...lazymarks[5],

	[/^([^—─―\n][^\n]+)\n([—─―])/gm, '$1\n\n$2'],
	[/^([—─―][^\n]+)\n([^—─―\n])/gm, '$1\n\n$2'],

	['[【]', '『'],
	['[】]', '』'],

	...(function (): IWords[]
	{
		let ret = [

			['拳帝', '拳帝'],
			['(?:錬|炼)金王', '錬金王'],
			//['梅雷亞', '梅雷亞'],
			['劍帝', '劍帝'],
			['水王', '水王'],
			['冰王', '冰王'],
			['炎帝', '炎帝'],
			['風神の六翼', '風神の六翼'],

			['(魔|王|帝|神)号', '$1'],

			['白神', '白神'],
			['名?号', '名号'],
			['術神', '術神'],
			['戦神', '戦神'],
			['百魔の主', '百魔の主'],
			['槍帝', '槍帝'],
			['魔槍', '魔槍'],
			['白帝', '白帝'],
			['天魔', '天魔'],
			['暴帝', '暴帝'],

			['魔神', '魔神'],
			['魔王', '魔王'],
			['英雄', '英雄'],

			['地王', '地王'],
			['地王の(剛|钢)鎚', '地王の剛鎚'],
			['天王の(剛|钢)鎚', '天王の剛鎚'],

			['薬(王|帝|神)', '薬$2'],

		].reduce(function (a, b)
		{
			let c = [
				`[《（「『【〈<](${b[0]})[』」》）】〉>]`,
				`《${b[1]}》`
				//`〈${b[1]}〉`
				,
			];

			a.push(_word_zh.apply(null, c as any));

			return a;
		}, [] as IWords[]);

		//console.log(ret);

		return ret;
	})(),

	['」\n《', '」\n\n《'],

]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
