/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe } from '.';
import * as StrUtil from 'str-util';

/**
 * 改成小說名字
 */
export const lang = '自称贤者弟子的贤者';

/**
 * 其他用途
 *
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words: IWords[] = [

	//['要取代的字', '取代後的字'],

	//['— —', '——'],

	['(方舟|弧形|弧光|阿萨|Ar[ck])[・ ]?(大地|地球|大陆|方舟|Earth)[　 ]*(online)?', '方舟・大地　ONLINE', 'ig'],

	['邓布鲁夫|邓不鲁夫', '邓布鲁夫'],


	['米拉|米菈', '米菈'],
	//['バルガ|巴鲁卡|巴尔加', '巴鲁卡'],
	['雪莱|雪莉', '雪莉'],

	//['艾尔达・卢米娜莉亚'],

	['雅阁加农炮|亚格加农炮', '亚格加农炮'],

	['克罗斯|克雷乌斯|クレオス', '克雷乌斯'],
	['Guraia|古瑞亚', '古瑞亚'],

	['艾梅汝|艾梅拉', '艾梅拉'],

	['所罗马|所罗门', '所罗门'],

	['希娜妲|赫娜塔', '赫娜塔'],

	['神之生命光辉的|神(之生)?命光辉的?圣杯', '神命光辉圣杯'],

	['哥布林|哥不林', '哥布林'],

	['召喚|召换', '召喚'],

	['Primal forest', 'Primal Forest', 'ig'],

	['玛那|玛娜', '玛娜'],

	[/[公工]会/g, '公会'],
	[/冒[险險]者([综总联]合?)?[公工][会會]/g, '冒险者综合公会'],

	[/(皇竜|精灵)\-/g, '$1・'],

	['苹果欧蕾|苹果牛奶', '苹果牛奶'],

	['重[复復]|重覆', '重覆'],
	['后', '後'],

	['这里', '这裡'],

	['　([。【「])', '$1'],
	['([。】」])　', '$1'],

	['十有八九', '十之八九'],

	['始祖的?种子', '始祖种子'],

	['树木?人', '树人'],

	['Sense', 'Sense', 'ig'],

	['(?:等级|Rank)[ \-]?([a-z])', '$1级', 'ig'],
	['([a-z])[ -]?(?:等?级|Rank)', '$1级', 'ig'],

	[/([^a-z\d\-\+\.])([a-z\d])(?![a-z\d\-\+\.])/ig, function (..._m)
	{
		return _m[1] + StrUtil.toFullWidth(_m[2]);
	}],

	[/[\!\(\):,]/g, function (...m)
	{
		return StrUtil.toFullWidth(m[0], {
			skip: {
				space: true,
			},
		});
	}],

	[/^[ \t　]+/gm, ''],

	[/^([^「」\n【】\[\]]*)[\[]([\u4E00-\u9FFF][^\n【】\[\]]*)[\]]/gm, '$1【$2】'],
	[/(「[^「」\n【】\[\]]*)[\[]([\u4E00-\u9FFF][^\n【】\[\]]*)[\]]/gm, '$1【$2】'],

	[/^([^\n"“”「」'\[\]]*)["“'\[]([\u4E00-\u9FFF][^\n"“”「」'\[\]]*(?:\n[^\n"“”「」'\[\]]*)?)["”'\]]/gm, '$1「$2」'],
	[/^([^\n"“”『』'‘’]*)["“'‘]([\u4E00-\u9FFF][^\n"“”『』'‘’]*)["”'’]/gm, '$1『$2』'],
	[/^([^\n【】<>]*)[<]([\u4E00-\u9FFF][^\n【】<>]*)[>]/gm, '$1【$2】'],

	[/(『[^『』\n]+』[^\n"“”『』'‘’]*)["“'‘]([\u4E00-\u9FFF][^\n"“”『』'‘’]*)["”'’]/gm, '$1『$2』'],
	[/(「[^「」\n]+」[^\n"“”「」'‘’]*)["“'‘]([\u4E00-\u9FFF][^\n"“”「」'‘’]*)["”'’]/gm, '$1「$2」'],
	[/(【[^【】\n<>\[\]]+】[^\n【】<>\[\]]*)[<\[]([\u4E00-\u9FFF][^\n【】<>\[\]]*)[\]>]/gm, '$1【$2】'],

	[/\[/g, '「'],
	[/\]/g, '」'],

	[/(「[^」]*)「([^」]*)」/g, '$1『$2』'],

	[/([^】\n])(\n【[^\n]+】\n)/g, '$1\n$2'],
	[/(\n【[^\n]+】\n)([^【\n])/g, '$1\n$2'],

] as IWords[];

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

export default exports;
