/**
 * Created by user on 2017/12/21/021.
 */

import { sp, IWords, vMaybe, sublib } from './index';
import * as StrUtil from 'str-util';
import { _word_en3, lazymarks, _word_jp1 } from './lib/index';

/**
 * 改成小說名字 (可留白 則自動設定為檔案名稱)
 */
export const lang = '';

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words_source: IWords[] = [

	_word_jp1('ジャック|傑克', '傑克'),
	_word_jp1('リーバー|利巴|利伯', '利巴'),

	_word_jp1('じーくん|基君', '基君'),

	[`傑克${sp}利巴`, '傑克・利巴'],

	/**
	 *
	 */
	_word_jp1('アネリ|阿涅莉|阿涅麗', '阿涅莉'),

	/**
	 *
	 */
	_word_jp1('ダイムクルド|戴姆庫爾德', '戴姆庫爾德'),
	_word_jp1('マデリン|瑪德琳', '瑪德琳'),
	_word_jp1('カラム|卡拉姆', '卡拉姆'),


	_word_jp1('チェルノ|切爾諾', '切爾諾'),
	_word_jp1('ポスフォード|波斯福德|波斯福特|玻斯福德', '波斯福德'),
	_word_jp1('フィリーネ|菲莉奈|菲利奈|菲莉涅', '菲莉奈'),
	_word_jp1('フィル|菲爾|菲兒|菲露|菲路', '菲兒'),

	/**
	 *
	 */
	_word_jp1('ラケル|瑞秋|拉凱爾', '瑞秋'),

	/**
	 *
	 */
	['深紅の貓|真紅の猫', '深紅之貓'],
	['血まみれ雌豹|浴血雌豹|血腥雌豹', '浴血雌豹'],

	_word_jp1('薇琪|ヴィッキー', '薇琪'),

	_word_jp1('本尼|ベニー|貝尼', '貝尼'),
	_word_en3('Benny', '貝尼'),

	_word_jp1('ビニー', '維尼'),

	/**
	 *
	 */
	_word_jp1('オースティン|奧斯汀|奧斯丁', '奧斯汀'),
	_word_jp1('阿泽雷亚|アゼレア|亞澤麗雅|阿塞利亞', '亞澤麗雅'),

	[`亞澤麗雅${sp}奧斯汀`, '亞澤麗雅・奧斯汀'],



	_word_jp1('屑拾いのバーグソン|撿破爛的伯格森', '撿破爛的伯格森'),

	_word_jp1('バーグソン|伯格森|布格森|巴古頌', '伯格森'),
	_word_jp1('ホゼア|何西阿|霍扎|霍齊亞', '霍齊亞'),
	_word_jp1('魯比|ルビー|露比', '露比'),

	[`露比${sp}伯格森`, '露比・伯格森'],
	[`露比伯格森`, '露比・伯格森'],

	_word_jp1('デンホルム|丹霍姆', '丹霍姆'),
	_word_jp1('バステード|巴斯蒂德|巴斯蒂杜', '巴斯蒂德'),

	_word_jp1('ガウェイン|高文|蓋恩|韋恩', '高文'),
	_word_jp1('マクドネル|麥克唐納|麥克唐奈', '麥克唐納'),

	[`高文${sp}唐納`, '高文・麥克唐納'],
	[`高文麥克唐納`, '高文・麥克唐納'],

	_word_jp1('エミリー|艾米莉', '艾米莉'),
	_word_jp1('オハラ|奧哈拉', '奧哈拉'),

	_word_jp1('キョウ|京', '京'),

	/**
	 *
	 */

	_word_jp1('トゥーラ|圖拉', '圖拉'),
	_word_jp1('クリーズ|克里斯|克萊斯', '克里斯'),

	[`圖拉${sp}克里斯`, '圖拉・克里斯'],

	_word_jp1('クライヴ|克萊夫|克萊布', '克萊夫'),

	_word_jp1('ロリババア|蘿莉老太婆', '蘿莉老太婆'),

	/**
	 *
	 */
	_word_jp1('埃爾維斯|エルヴィス|欸爾維斯|艾露比斯|艾路瓦斯', '埃爾維斯'),
	_word_jp1('昆茨|クンツ', '昆茨'),
	_word_jp1('溫莎|ウィンザー|溫扎', '溫莎'),

	_word_jp1('愛德華茲|エドワーズ', '愛德華茲'),

	[`昆茨${sp}溫莎`, '昆茨・溫莎'],

	[`埃爾維斯${sp}昆茨${sp}溫莎`, '埃爾維斯＝昆茨・溫莎'],

	/**
	 *
	 */
	_word_jp1('ラヴィニア|拉維妮婭', '拉維妮婭'),
	_word_jp1('フィッツヘルベルト|菲絲赫爾貝特|菲茨赫爾伯特', '菲絲赫爾貝特'),

	_word_jp1('ジムズィルクス|吉姆西盧克斯', '吉姆西盧克斯'),

	_word_jp1('阿倫|アーロン|阿龍|亞倫|亞隆', '阿倫'),
	_word_jp1('ブルーイット|布魯伊茲托|布魯依德', '布魯依德'),

	_word_jp1('ルクレツィア|露庫露琪亞', '露庫露琪亞'),
	_word_jp1('グラツィアーニ|格拉茨亞尼', '格拉茨亞尼'),

	_word_jp1('メリンダ|梅琳達', '梅琳達'),

	_word_jp1('アデラ|阿黛拉', '阿黛拉'),
	_word_jp1('エイトキン|艾德金', '艾德金'),

	_word_jp1('ベリル', '貝利露'),

	/**
	 *
	 */
	_word_jp1('ブレンダン|布蘭登|布拉登|アルヴィン', '布蘭登'),
	_word_jp1('マスグレイヴ|馬斯格雷夫|馬斯格雷夫|マグナンティ', '馬斯格雷夫'),

	_word_jp1('アルヴィン・マグナンティ', 'アルヴィン・マグナンティ'),

	/**
	 *
	 */

	_word_jp1('ブラッドリー|布拉德利', '布拉德利'),
	_word_jp1('モグリッジ|莫德里奇', '莫德里奇'),

	_word_jp1('メイジー|梅茜|麥基', '梅茜'),
	_word_jp1('サウスオール|索撒爾|索魯', '索撒爾'),

	/**
	 *
	 */
	_word_jp1('アマベル|阿瑪貝魯', '阿瑪貝魯'),

	/**
	 *
	 */
	_word_jp1('エリアス', '艾利亞斯'),

	_word_jp1('ブレイディア', '布萊迪亞'),

	_word_jp1('ロウ', '羅烏'),

	_word_jp1('ラエス|拉耶斯', '拉斯'),

	_word_jp1('ヘルミーナ', '赫露米娜'),
	_word_jp1('フォン', '馮'),

	_word_jp1('ダッド', '達德'),
	_word_jp1('グレーヴス', '格雷瓦斯'),

	_word_jp1('サミジーナ|薩米奇娜', '薩米吉娜'),

	/**
	 *
	 */
	_word_jp1('レイナーディア|雷娜蒂亞', '雷娜蒂亞'),
	['指輪教|戒指教', '指輪教'],

	/**
	 *
	 */

	_word_jp1('毕弗朗斯|ビフロンス|毕弗隆斯', '畢弗隆斯'),
	_word_en3('Bifrons', '畢弗隆斯'),

	_word_jp1('アンドレアルフス|安德雷安富斯?|安德烈亞斯', '安德雷安富'),

	_word_jp1('艾尼|アイム|亞蒙', '艾尼'),
	_word_jp1('佛卡洛|フォカロル', '佛卡洛'),
	_word_jp1('拜蒙|パイモン', '拜蒙'),
	_word_jp1('比利士|ベリト|貝利特', '貝利特'),
	_word_jp1('莫拉格斯|モラクス|摩拉克斯', '莫拉格斯'),

	_word_jp1('摩洛貘|モロバク', '摩洛貘'),

	_word_jp1('バルバトス', '巴巴妥司'),
	_word_jp1('ブエル', '布爾'),
	_word_jp1('ヴィネ', '拜恩'),

	['誠實なる鎹|真誠締合', '真誠締合'],

	_word_jp1('オロバス', '歐洛巴士'),

	['巣立ちの透翼|離巢的透翼', '離巢的透翼'],
	['絶跡の虛穴', '絶跡的虛穴'],
	['原魚の御手|原魚元和的御手', '原魚の御手'],
	['傍観する騒亂|暴亂的旁觀者', '暴亂的旁觀者'],
	['不撓の柱石', '不撓的柱石'],
	['尊離的安德雷安富|珍視離別的安德雷安富', '珍視離別的安德雷安富'],



	['贗品的世界|偽物の世界', '偽物の世界'],

	['精靈的栖木|精霊の止まり木|精靈本靈附體的栖木', '精靈的栖木'],

	['本靈憑依者|本靈附體|ｒｏｏｓｔ|ｒｏｏＳｔ|Roost', '本靈附體', 'ig'],

	_word_jp1('ルースト', '栖木'),

	_word_jp1('本霊憑き', '本靈附體'),

	_word_jp1('エレメント・アウト', 'エレメント・アウト'),

	/**
	 *
	 */
	_word_jp1('あかつきの剣|拂曉之劍', '拂曉之劍'),
	_word_jp1('闘術場', '闘術場'),
	_word_jp1('ヒヒイロカネ|緋緋色金', '緋緋色金'),

	_word_jp1('ルーティン', '程序'),

	/**
	 *
	 */
	_word_jp1('エルフ', 'ELF'),
	_word_jp1('フィアーマ|斐爾瑪', '斐爾瑪'),

	_word_jp1('パラガン|帕拉甘特', '帕拉甘特'),

	_word_en3('Cat Sith', '貓妖精'),

	_word_jp1('ハーフリング', '哈比人'),

	/**
	 *
	 */
	_word_jp1('雷纳第亚|雷娜蒂雅', '雷娜蒂雅'),

	/**
	 *
	 */
	_word_jp1('ヴラスタ|维拉苏塔|瓦拉斯塔', '瓦拉斯塔'),

	/**
	 *
	 */
	['川越怜奈', '川越怜奈'],
	['怜奈', '怜奈'],

	_word_jp1('さん', '桑'),

	/**
	 *
	 */
	_word_jp1('トライザドラ', '托萊薩多拉'),

	['弹坑创造者|环形山制造者', '環形坑製造者'],

	['海市蜃樓', '蜃氣樓'],

	_word_jp1('ヴォイド・ボム|無質量炸彈', '虛空炸彈'),
	_word_en3('void・bomb', '虛空炸彈'),


	_word_jp1('精霊励起システム', '精靈勵起系統'),

];

/**
 * 實際使用的取代樣式
 */
export const words: IWords[] = _word_zh_all([

	...words_source,

	['暗商人', '闇商人'],

	['哥布林哥布林の', '哥布林ゴブリンの'],

	[/^[◎#]$/gm, ''],
	[/^　+/gm, ''],

	[/(?<=\S)\n{1,2}(?=[◆◇◎])/gm, '\n\n\n'],

	[/(?<=[^─\n])\n(?=─)/gm, '\n\n'],

	[/(?<=^─[^\n]+)\n(?=[^─\n])/gm, '\n\n'],

	...lazymarks['class'],
	//...lazymarks['zh_cht'],

	//...lazymarks['unit'],

	...lazymarks[4],

	...lazymarks['full_width_001'],
	...lazymarks['full_width_002'],

	...lazymarks[0],
	...lazymarks[1],
	...lazymarks[2],
	...lazymarks[3],
	...lazymarks[5],

	...lazymarks['ln_0010'],

] as IWords[]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

/**
 * 其他用途
 *
 * @deprecated
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

export default exports as typeof import('./demo');
