/**
 * Created by user on 2017/12/21/021.
 */

import lazymarks from '@node-novel/layout-pattern/lib/core/pattern/index';
import { _word_en, _word_en3, _word_jp1, _word_zh_all } from '@node-novel/layout-pattern/lib/core/word';
import { IWords, vMaybe, IWordsAll } from '@node-novel/layout-pattern/lib/core/word';
import { _zh_num2, sp, sp2, _zh_num, _full_num, EN_REGEXP } from '@node-novel/layout-pattern/lib/core/const';
import { IPatternRule } from '@node-novel/layout-pattern/lib/core/types';
import * as StrUtil from 'str-util';

/**
 * 改成小說名字 (可留白 則自動設定為檔案名稱)
 */
export const lang = '';

/**
 * 在這裡放此小說專屬的取代樣本
 */
export const words_source: IWords[] = [

	_word_jp1('ジャック|傑克', '傑克'),
	_word_jp1('リーバー|利巴|利伯', '利巴'),

	_word_jp1('じーくん|基君', '基君'),

	[`(?:傑克|薩米吉娜)${sp}利巴`, '$1・利巴'],

	/**
	 *
	 */
	_word_jp1('アネリ|阿涅莉|阿涅麗', '阿涅莉'),

	/**
	 *
	 */
	_word_jp1('ダイムクルド|戴姆庫爾德', '戴姆庫爾德'),
	_word_jp1('マデリン|瑪德琳', '瑪德琳'),
	_word_jp1('カラム|卡拉姆', '卡拉姆'),


	_word_jp1('チェルノ|切爾諾', '切爾諾'),
	_word_jp1('ポスフォード|波斯福德|波斯福特|玻斯福德', '波斯福德'),
	_word_jp1('フィリーネ|菲莉奈|菲利奈|菲莉涅', '菲莉涅'),
	_word_jp1('フィル|菲爾|菲兒|菲露|菲路', '菲兒'),

	/**
	 *
	 */
	_word_jp1('ラケル|瑞秋|拉凱爾', '瑞秋'),

	/**
	 *
	 */
	['深紅の貓|真紅の猫', '深紅之貓'],
	['血まみれ雌豹|浴血雌豹|血腥雌豹', '浴血雌豹'],

	_word_jp1('薇琪|ヴィッキー', '薇琪'),

	_word_jp1('本尼|ベニー|貝尼', '貝尼'),
	_word_en3('Benny', '貝尼'),

	_word_jp1('ビニー', '維尼'),

	/**
	 *
	 */
	_word_jp1('オースティン|奧斯汀|奧斯丁', '奧斯汀'),
	_word_jp1('阿泽雷亚|アゼレア|亞澤麗雅|阿塞利亞', '亞澤麗雅'),

	[`亞澤麗雅${sp}奧斯汀`, '亞澤麗雅・奧斯汀'],



	_word_jp1('屑拾いのバーグソン|撿破爛的伯格森', '撿破爛的伯格森'),

	_word_jp1('バーグソン|伯格森|布格森|巴古頌', '伯格森'),
	_word_jp1('ホゼア|何西阿|霍扎|霍齊亞', '霍齊亞'),
	_word_jp1('魯比|ルビー|露比', '露比'),

	[`露比${sp}伯格森`, '露比・伯格森'],
	[`露比伯格森`, '露比・伯格森'],

	_word_jp1('デンホルム|丹霍姆', '丹霍姆'),
	_word_jp1('バステード|巴斯蒂德|巴斯蒂杜', '巴斯蒂德'),

	_word_jp1('ガウェイン|高文|蓋恩|韋恩', '高文'),
	_word_jp1('マクドネル|麥克唐納|麥克唐奈', '麥克唐納'),

	[`高文${sp}唐納`, '高文・麥克唐納'],
	[`高文麥克唐納`, '高文・麥克唐納'],

	_word_jp1('エミリー|艾米莉', '艾米莉'),
	_word_jp1('オハラ|奧哈拉', '奧哈拉'),

	_word_jp1('キョウ|京', '京'),

	/**
	 *
	 */


	_word_jp1('トゥーラ|圖拉', '圖拉'),
	_word_jp1('クリーズ|克里斯|克萊斯', '克里斯'),

	[`圖拉${sp}克里斯`, '圖拉・克里斯'],

	_word_jp1('クライヴ|克萊夫|克萊布', '克萊夫'),

	_word_jp1('ロリババア|蘿莉老太婆', '蘿莉老太婆'),

	/**
	 *
	 */
	_word_jp1('埃爾維斯|エルヴィス|欸爾維斯|艾露比斯|艾路瓦斯|艾爾維斯', '埃爾維斯'),
	_word_jp1('昆茨|クンツ', '昆茨'),
	_word_jp1('溫莎|ウィンザー|溫扎', '溫莎'),

	_word_jp1('愛德華茲|エドワーズ', '愛德華茲'),

	[`昆茨${sp}溫莎`, '昆茨・溫莎'],

	[`埃爾維斯${sp}昆茨${sp}溫莎`, '埃爾維斯＝昆茨・溫莎'],

	/**
	 *
	 */
	_word_jp1('ラヴィニア|拉維妮婭', '拉維妮婭'),
	_word_jp1('フィッツヘルベルト|菲絲赫爾貝特|菲茨赫爾伯特', '菲絲赫爾貝特'),

	_word_jp1('ジムズィルクス|吉姆西盧克斯', '吉姆西盧克斯'),

	_word_jp1('阿倫|アーロン|阿龍|亞倫|亞隆', '阿倫'),
	_word_jp1('ブルーイット|布魯伊茲托|布魯依德', '布魯依德'),

	_word_jp1('ルクレツィア|露庫露琪亞', '露庫露琪亞'),
	_word_jp1('グラツィアーニ|格拉茨亞尼', '格拉茨亞尼'),

	_word_jp1('メリンダ|梅琳達', '梅琳達'),

	_word_jp1('アデラ|阿黛拉', '阿黛拉'),
	_word_jp1('エイトキン|艾德金', '艾德金'),

	_word_jp1('ベリル', '貝利露'),

	/**
	 *
	 */
	_word_jp1('ブレンダン|布蘭登|布拉登|アルヴィン', '布蘭登'),
	_word_jp1('マスグレイヴ|馬斯格雷夫|馬斯格雷夫|マグナンティ', '馬斯格雷夫'),

	_word_jp1('アルヴィン・マグナンティ', 'アルヴィン・マグナンティ'),

	/**
	 *
	 */

	_word_jp1('ブラッドリー|布拉德利', '布拉德利'),
	_word_jp1('モグリッジ|莫德里奇', '莫德里奇'),

	_word_jp1('メイジー|梅茜|麥基', '梅茜'),
	_word_jp1('サウスオール|索撒爾|索魯', '索撒爾'),

	/**
	 *
	 */
	_word_jp1('アマベル|阿瑪貝魯', '阿瑪貝魯'),

	/**
	 *
	 */
	_word_jp1('エリアス', '艾利亞斯'),

	_word_jp1('ブレイディア|佈萊迪亞', '布萊迪亞'),

	_word_jp1('ロウ', '羅烏'),

	_word_jp1('ヒルデブラント', '希爾德布蘭特'),

	_word_jp1('センリ', '塞利'),

	_word_jp1('エヴェリーナ', '埃維琳娜'),
	_word_jp1('アンツァネッロ', '安查內羅'),

	_word_jp1('ベリザーリオ', '貝利扎里奧'),
	_word_jp1('ブリンクマン', '布林克曼'),

	[`埃維琳娜${sp}安查內羅`, '埃維琳娜・安查內羅'],

	/**
	 * @todo 將 拉斯 取代為 ラエス
	 */
	_word_jp1('ラエス|拉耶斯|拉埃斯', '拉耶斯'),

	_word_jp1('ヘルミーナ|赫爾米娜', '赫露米娜'),
	_word_jp1('フォン', '馮'),

	_word_jp1('ダッド', '達德'),
	_word_jp1('グレーヴス', '格雷瓦斯'),

	_word_jp1('サミジーナ|薩米奇娜|薩米基納', '薩米吉娜'),
	_word_jp1('迷える星の(?:サミジーナ|薩米吉娜)', '迷惑星辰的薩米吉娜'),



	/**
	 *
	 */
	_word_jp1('ゼルギウス', '澤爾吉斯'),
	_word_jp1('マグヌス', '馬庫努斯'),

	/**
	 *
	 */
	_word_jp1('レイナーディア|雷娜蒂亞|雷娜蒂雅', '雷娜蒂亞'),
	['指輪教|戒指教', '指輪教'],

	_word_jp1('ノモラス', '諾摩拉斯'),
	['祭拜大聖教堂|聖大霊拝堂', '聖大靈拜堂'],
	['聖諾摩拉斯大教堂', '聖諾摩拉斯大靈拜堂'],

	/**
	 *
	 */
	['外交都市|外交城市', '外交都市'],
	_word_jp1('スノーモー', '斯諾摩'),

	/**
	 *
	 */

	_word_jp1('毕弗朗斯|ビフロンス|毕弗隆斯', '畢弗隆斯'),
	_word_en3('Bifrons', '畢弗隆斯'),

	_word_jp1('アンドレアルフス|安德雷安富斯?|安德烈亞斯', '安德雷安富'),

	_word_jp1('艾尼|アイム|亞蒙', '艾尼'),
	_word_jp1('佛卡洛|フォカロル', '佛卡洛'),
	_word_jp1('拜蒙|パイモン', '拜蒙'),
	_word_jp1('比利士|ベリト|貝利特', '貝利特'),
	_word_jp1('莫拉格斯|モラクス|摩拉克斯', '莫拉格斯'),

	_word_jp1('虛偽散華的貝利特|偽物散去的貝利特', '虛偽散華的貝利特'),

	_word_jp1('摩洛貘|モロバク', '摩洛貘'),

	_word_jp1('バルバトス|巴巴托斯', '巴巴妥司'),
	_word_jp1('爪弾く聲の(?:バルバトス|巴巴妥司)', '指尖彈奏的巴巴托斯'),

	/**
	 * @todo 將 布爾 取代為 ブエル
	 *
	 */
	_word_jp1('ブエル|布耶爾|佈耶爾|帕爾', '布耶爾'),
	_word_jp1('形なき驚愕の(?:ブエル|布耶爾)', '無形驚愕的布耶爾'),

	_word_jp1('バアル', '巴爾'),

	_word_jp1('ヴィネ', '拜恩'),

	['誠實なる鎹|真誠締合', '真誠締合'],

	_word_jp1('オロバス', '歐洛巴士'),

	['巣立ちの透翼|離巢的透翼', '離巢的透翼'],
	['絶跡の虛穴|絶對痕跡的虛穴', '絶跡的虛穴'],
	['原魚の御手|原魚元和的御手', '原魚の御手'],
	['傍観する騒亂|暴亂的旁觀者', '暴亂的旁觀者'],
	['不撓の柱石', '不撓的柱石'],
	['尊離的安德雷安富|珍視離別的安德雷安富', '珍視離別的安德雷安富'],

	_word_jp1('シャックス', '沙克斯'),
	_word_jp1('アガレス', '阿加雷斯'),

	_word_jp1('納貝里烏斯|納貝里士|ナベリウス', '納貝里烏斯'),
	['三矢的文殊|三矢の文殊|三箭文殊', '三矢的文殊'],

	['贗品的世界|偽物の世界', '偽物の世界'],

	['精靈的栖木|精霊の止まり木|精靈本靈附體的栖木', '精靈的栖木'],

	['本靈憑依者|本靈附體|ｒｏｏｓｔ|ｒｏｏＳｔ|Roost', '本靈附體', 'ig'],

	_word_jp1('ルースト', '栖木'),

	_word_jp1('本霊憑き', '本靈附體'),

	_word_jp1('エレメント・アウト', 'エレメント・アウト'),

	/**
	 * ネーマ是英语namer的外来语(命名者 持名者)
	 */
	_word_jp1('ネーマ', 'Nema'),
	_word_en3('Nema', 'Nema'),

	/**
	 *
	 */
	_word_jp1('あかつきの剣|拂曉之劍', '拂曉之劍'),
	_word_jp1('闘術場', '闘術場'),
	_word_jp1('ヒヒイロカネ|緋緋色金', '緋緋色金'),

	_word_jp1('ルーティン', '程序'),

	/**
	 *
	 */
	_word_jp1('エルフ', 'ELF'),
	_word_jp1('フィアーマ|斐爾瑪', '斐爾瑪'),

	_word_jp1('パラガン|帕拉甘特', '帕拉甘特'),

	_word_en3('Cat Sith', '貓妖精'),

	_word_jp1('ハーフリング', '哈比人'),

	/**
	 *
	 */
	_word_jp1('雷纳第亚|雷娜蒂雅', '雷娜蒂雅'),

	/**
	 *
	 */
	_word_jp1('ヴラスタ|维拉苏塔|瓦拉斯塔|布拉斯塔', '布拉斯塔'),

	_word_jp1('デイナ', '戴娜'),
	_word_jp1('バルビローリ', '巴露比羅莉'),

	_word_jp1('シトリ', '希托莉'),

	/**
	 *
	 */
	_word_jp1('エイトザドラ', '艾托薩多拉'),

	/**
	 *
	 */
	['川越怜奈', '川越怜奈'],
	['怜奈', '怜奈'],

	_word_jp1('さん', '桑'),

	/**
	 *
	 */
	_word_jp1('トライザドラ', '托萊薩多拉'),

	['弹坑创造者|环形山制造者', '環形坑製造者'],

	['海市蜃樓', '蜃氣樓'],

	_word_jp1('ヴォイド・ボム|無質量炸彈', '虛空炸彈'),
	_word_en3('void(?:・| )bomb', '虛空炸彈'),

	_word_jp1('太陽破風|太陽爆風|太陽風暴', '太陽風暴'),
	_word_en3('Moment(?: |・)Burst', '太陽風暴'),


	_word_jp1('精霊励起システム|精靈激發系統|精靈勵起系統', '精靈勵起系統'),

];

/**
 * 實際使用的取代樣式
 */
export const words: IWords[] = _word_zh_all([

	...words_source,

	['暗商人', '闇商人'],

	['闘術大会', '闘術大會'],

	['哥布林哥布林の', '哥布林ゴブリンの'],

	['女仆', '女僕'],

	[/^[◎#]$/gm, ''],
	[/^　+/gm, ''],

	_word_en3('AAA', 'ＡＡＡ'),



	[/(?<=\S)\n{1,2}(?=[◆◇◎])/gm, '\n\n\n'],

	[/(?<=[^─\n])\n(?=─)/gm, '\n\n'],

	[/(?<=^─[^\n]+)\n(?=[^─\n])/gm, '\n\n'],

	...lazymarks['clear_002'],

	...lazymarks['class'],
	//...lazymarks['zh_cht'],

	//...lazymarks['unit'],

	...lazymarks['4'],

	...lazymarks['full_width_001'],
	...lazymarks['full_width_002'],

	...lazymarks['0'],
	...lazymarks['1'],
	...lazymarks['2'],
	...lazymarks['3'],
	...lazymarks['5'],

	...lazymarks['ln_0010'],

	...lazymarks['ln_talk'],

] as IWords[]);

/**
 * 需要人工確認的屏蔽字或錯字用語等等
 */
export const words_maybe: vMaybe = [

	//'需要偵測的字',

] as vMaybe;

/**
 * 分析取代完成後執行的代碼
 *
 * @param {string} text
 * @returns {string}
 */
export function words_callback(text: string): string
{
	return text;
}

/**
 * 其他用途
 *
 * @deprecated
 * @type {{chapter_id: string; chapter_title: string; volume_id: string; volume_title: string}}
 */
export const value = {
	chapter_id: '第{{0}}話',
	chapter_title: `$t(chapter_id, [{{0}}])　{{title}}`,

	volume_id: '第{{0}}章',
	volume_title: `$t(chapter_id, [{{0}}])：{{title}}`,
};

export default exports as typeof import('./demo');
